<abi-corpus version='2.2' path='/home/x/projects/pygo-frontier/src/runloom_c.cpython-313t-x86_64-linux-gnu.so'>
  <elf-needed>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='PyInit_runloom_c' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='runloom_advice_autosize_enabled' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='runloom_advice_enabled' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='runloom_advice_note_spawn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='runloom_advice_record' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='runloom_advice_record_g' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='runloom_advice_report' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='runloom_advice_reset' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='runloom_advice_reset_after_fork' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='runloom_spawn_fault_armed' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='runloom_stack_autocap_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='runloom_stack_autocap_reset' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='runloom_stack_autocap_tick' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='runloom_tcp_c_fd_close' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='runloom_tcp_c_fd_recv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='runloom_tcp_c_fd_send_all' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='runloom_tcpconn_c_recv_into' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='runloom_tcpconn_c_send_all' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='runloom_tcpconn_capi_register' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='runloom_tcpconn_register' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='runloom_tstate_in_destruction' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='runloom_wait_reason_name' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='runloom_wake_trace_event' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='runloom_blockpool_worker_thread_fini' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='runloom_crash_selftest_sink' size='1' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='runloom_debug_flags' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='runloom_ldfi_count' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='runloom_ldfi_drop_set' size='256' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='runloom_ldfi_dropn' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='runloom_mn_seg_track' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='src/runloom_c/arch/swap_x86_64.S' language='LANG_Mips_Assembler'>
    <function-decl name='runloom_asm_swap' mangled-name='runloom_asm_swap' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_asm_swap'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='runloom_asm_trampoline' mangled-name='runloom_asm_trampoline' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_asm_trampoline'>
      <return type-id='type-id-1'/>
    </function-decl>
    <type-decl name='void' id='type-id-1'/>
  </abi-instr>
  <abi-instr address-size='64' path='src/runloom_c/chan.c' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='64' id='type-id-3'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-4' id='type-id-5'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='512' id='type-id-6'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-4' id='type-id-7'/>
    </array-type-def>
    <type-decl name='char' size-in-bits='8' id='type-id-8'/>
    <array-type-def dimensions='1' type-id='type-id-8' size-in-bits='320' id='type-id-9'>
      <subrange length='40' lower-bound='0' upper-bound='39' type-id='type-id-4' id='type-id-10'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-8' size-in-bits='32' id='type-id-11'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-4' id='type-id-12'/>
    </array-type-def>
    <type-decl name='double' size-in-bits='64' id='type-id-13'/>
    <enum-decl name='PySendResult' naming-typedef-id='type-id-14' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/object.h' line='1151' column='1' id='type-id-15'>
      <underlying-type type-id='type-id-16'/>
      <enumerator name='PYGEN_RETURN' value='0'/>
      <enumerator name='PYGEN_ERROR' value='-1'/>
      <enumerator name='PYGEN_NEXT' value='1'/>
    </enum-decl>
    <enum-decl name='runloom_evt_op' filepath='src/runloom_c/runloom_diag.h' line='62' column='1' id='type-id-17'>
      <underlying-type type-id='type-id-16'/>
      <enumerator name='RUNLOOM_EVT_NONE' value='0'/>
      <enumerator name='RUNLOOM_EVT_PARKER_LINK' value='1'/>
      <enumerator name='RUNLOOM_EVT_PARKER_UNLINK' value='2'/>
      <enumerator name='RUNLOOM_EVT_PARKER_WAKE' value='3'/>
      <enumerator name='RUNLOOM_EVT_PARKER_TIMEOUT' value='4'/>
      <enumerator name='RUNLOOM_EVT_PARKER_GHOST' value='5'/>
      <enumerator name='RUNLOOM_EVT_PARKER_FORCE' value='6'/>
      <enumerator name='RUNLOOM_EVT_G_TRANSITION' value='7'/>
      <enumerator name='RUNLOOM_EVT_G_SUBMIT' value='8'/>
      <enumerator name='RUNLOOM_EVT_G_POP' value='9'/>
      <enumerator name='RUNLOOM_EVT_G_DECREF' value='10'/>
      <enumerator name='RUNLOOM_EVT_G_COMPLETE' value='11'/>
      <enumerator name='RUNLOOM_EVT_CHAN_PARK' value='12'/>
      <enumerator name='RUNLOOM_EVT_CHAN_WAKE' value='13'/>
      <enumerator name='RUNLOOM_EVT_CORO_ACQUIRE' value='14'/>
      <enumerator name='RUNLOOM_EVT_CORO_RELEASE' value='15'/>
      <enumerator name='RUNLOOM_EVT_CAL_FREEZE' value='16'/>
      <enumerator name='RUNLOOM_EVT_HANDOFF_ADOPT' value='17'/>
      <enumerator name='RUNLOOM_EVT_WORLD_YIELD' value='18'/>
      <enumerator name='RUNLOOM_EVT_SNAP_SAVE' value='19'/>
      <enumerator name='RUNLOOM_EVT_SNAP_LOAD' value='20'/>
      <enumerator name='RUNLOOM_EVT__LAST' value='21'/>
    </enum-decl>
    <enum-decl name='runloom_g_state' filepath='src/runloom_c/runloom_gstate.h' line='43' column='1' id='type-id-18'>
      <underlying-type type-id='type-id-16'/>
      <enumerator name='RUNLOOM_GST_INIT' value='0'/>
      <enumerator name='RUNLOOM_GST_SPAWNING' value='1'/>
      <enumerator name='RUNLOOM_GST_RUNNABLE' value='2'/>
      <enumerator name='RUNLOOM_GST_SUBMITTED' value='3'/>
      <enumerator name='RUNLOOM_GST_RUNNING' value='4'/>
      <enumerator name='RUNLOOM_GST_PARKED_NETPOLL' value='5'/>
      <enumerator name='RUNLOOM_GST_PARKED_CHAN' value='6'/>
      <enumerator name='RUNLOOM_GST_PARKED_SLEEP' value='7'/>
      <enumerator name='RUNLOOM_GST_PARKED_SAFE' value='8'/>
      <enumerator name='RUNLOOM_GST_WAKING' value='9'/>
      <enumerator name='RUNLOOM_GST_DONE' value='10'/>
      <enumerator name='RUNLOOM_GST_FREED' value='11'/>
      <enumerator name='RUNLOOM_GST__LAST' value='12'/>
    </enum-decl>
    <enum-decl name='runloom_select_op_t' naming-typedef-id='type-id-19' filepath='src/runloom_c/chan.h' line='101' column='1' id='type-id-20'>
      <underlying-type type-id='type-id-16'/>
      <enumerator name='RUNLOOM_SELECT_RECV' value='0'/>
      <enumerator name='RUNLOOM_SELECT_SEND' value='1'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' id='type-id-21'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-22'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-23'/>
    <array-type-def dimensions='1' type-id='type-id-24' size-in-bits='64' id='type-id-25'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-4' id='type-id-5'/>
    </array-type-def>
    <type-decl name='short int' size-in-bits='16' id='type-id-26'/>
    <class-decl name='PyAsyncMethods' size-in-bits='256' is-struct='yes' naming-typedef-id='type-id-27' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='129' column='1' id='type-id-28'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='am_await' type-id='type-id-29' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='am_aiter' type-id='type-id-29' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='am_anext' type-id='type-id-29' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='am_send' type-id='type-id-30' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='133' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyBufferProcs' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-31' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='136' column='1' id='type-id-32'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bf_getbuffer' type-id='type-id-33' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bf_releasebuffer' type-id='type-id-34' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='138' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyGetSetDef' size-in-bits='320' is-struct='yes' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/descrobject.h' line='11' column='1' id='type-id-35'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-36' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/descrobject.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='get' type-id='type-id-37' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/descrobject.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='set' type-id='type-id-38' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/descrobject.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='doc' type-id='type-id-36' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/descrobject.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='closure' type-id='type-id-39' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/descrobject.h' line='16' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyMappingMethods' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-40' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='121' column='1' id='type-id-41'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mp_length' type-id='type-id-42' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mp_subscript' type-id='type-id-43' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mp_ass_subscript' type-id='type-id-44' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='124' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyMemberDef' size-in-bits='320' is-struct='yes' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/descrobject.h' line='41' column='1' id='type-id-45'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-36' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/descrobject.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='type-id-21' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/descrobject.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='offset' type-id='type-id-46' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/descrobject.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='flags' type-id='type-id-21' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/descrobject.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='doc' type-id='type-id-36' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/descrobject.h' line='46' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyMethodDef' size-in-bits='256' is-struct='yes' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/methodobject.h' line='59' column='1' id='type-id-47'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ml_name' type-id='type-id-36' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/methodobject.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ml_meth' type-id='type-id-48' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/methodobject.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ml_flags' type-id='type-id-21' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/methodobject.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ml_doc' type-id='type-id-36' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/methodobject.h' line='64' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyMutex' size-in-bits='8' is-struct='yes' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/lock.h' line='29' column='1' id='type-id-49'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_bits' type-id='type-id-50' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/lock.h' line='30' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyNumberMethods' size-in-bits='2304' is-struct='yes' naming-typedef-id='type-id-51' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='60' column='1' id='type-id-52'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_add' type-id='type-id-43' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nb_subtract' type-id='type-id-43' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nb_multiply' type-id='type-id-43' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nb_remainder' type-id='type-id-43' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='nb_divmod' type-id='type-id-43' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='nb_power' type-id='type-id-53' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='nb_negative' type-id='type-id-29' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='nb_positive' type-id='type-id-29' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='nb_absolute' type-id='type-id-29' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='nb_bool' type-id='type-id-54' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='nb_invert' type-id='type-id-29' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='nb_lshift' type-id='type-id-43' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='nb_rshift' type-id='type-id-43' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='nb_and' type-id='type-id-43' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='nb_xor' type-id='type-id-43' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='nb_or' type-id='type-id-43' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='nb_int' type-id='type-id-29' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='nb_reserved' type-id='type-id-39' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='nb_float' type-id='type-id-29' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='nb_inplace_add' type-id='type-id-43' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='nb_inplace_subtract' type-id='type-id-43' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='nb_inplace_multiply' type-id='type-id-43' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='nb_inplace_remainder' type-id='type-id-43' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='nb_inplace_power' type-id='type-id-53' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='nb_inplace_lshift' type-id='type-id-43' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='nb_inplace_rshift' type-id='type-id-43' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='nb_inplace_and' type-id='type-id-43' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='nb_inplace_xor' type-id='type-id-43' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='nb_inplace_or' type-id='type-id-43' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='nb_floor_divide' type-id='type-id-43' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='nb_true_divide' type-id='type-id-43' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='nb_inplace_floor_divide' type-id='type-id-43' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='nb_inplace_true_divide' type-id='type-id-43' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='nb_index' type-id='type-id-29' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='nb_matrix_multiply' type-id='type-id-43' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='nb_inplace_matrix_multiply' type-id='type-id-43' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='104' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PySequenceMethods' size-in-bits='640' is-struct='yes' naming-typedef-id='type-id-55' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='107' column='1' id='type-id-56'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sq_length' type-id='type-id-42' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sq_concat' type-id='type-id-43' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sq_repeat' type-id='type-id-57' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sq_item' type-id='type-id-57' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='was_sq_slice' type-id='type-id-39' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='sq_ass_item' type-id='type-id-58' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='was_sq_ass_slice' type-id='type-id-39' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='sq_contains' type-id='type-id-59' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='sq_inplace_concat' type-id='type-id-43' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='sq_inplace_repeat' type-id='type-id-57' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='118' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyVarObject' size-in-bits='320' is-struct='yes' naming-typedef-id='type-id-60' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/object.h' line='224' column='1' id='type-id-61'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-62' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/object.h' line='225' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ob_size' type-id='type-id-46' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/object.h' line='226' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Py_buffer' size-in-bits='640' is-struct='yes' naming-typedef-id='type-id-63' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/pybuffer.h' line='20' column='1' id='type-id-64'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buf' type-id='type-id-39' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/pybuffer.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='obj' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/pybuffer.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='len' type-id='type-id-46' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/pybuffer.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='itemsize' type-id='type-id-46' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/pybuffer.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='readonly' type-id='type-id-21' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/pybuffer.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='ndim' type-id='type-id-21' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/pybuffer.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='format' type-id='type-id-65' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/pybuffer.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='shape' type-id='type-id-66' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/pybuffer.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='strides' type-id='type-id-66' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/pybuffer.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='suboffsets' type-id='type-id-66' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/pybuffer.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='internal' type-id='type-id-39' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/pybuffer.h' line='32' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='51' column='1' id='type-id-67'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='type-id-68' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='type-id-68' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='54' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='22' column='1' id='type-id-69'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='type-id-21' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='type-id-70' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='type-id-21' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='type-id-70' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='type-id-21' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='type-id-26' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='type-id-26' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='type-id-71' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_err_stackitem' size-in-bits='128' is-struct='yes' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='32' column='1' id='type-id-72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='exc_value' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='previous_item' type-id='type-id-73' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='48' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_object' size-in-bits='256' is-struct='yes' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/object.h' line='207' column='1' id='type-id-74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_tid' type-id='type-id-75' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/object.h' line='211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_padding' type-id='type-id-76' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/object.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='ob_mutex' type-id='type-id-77' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/object.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='88'>
        <var-decl name='ob_gc_bits' type-id='type-id-50' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/object.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='ob_ref_local' type-id='type-id-78' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/object.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ob_ref_shared' type-id='type-id-46' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/object.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ob_type' type-id='type-id-79' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/object.h' line='217' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_stack_chunk' size-in-bits='256' is-struct='yes' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='52' column='1' id='type-id-80'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='previous' type-id='type-id-81' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-82' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='top' type-id='type-id-82' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='data' type-id='type-id-3' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='56' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_ts' size-in-bits='2496' is-struct='yes' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='59' column='1' id='type-id-83'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='prev' type-id='type-id-84' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='type-id-84' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='interp' type-id='type-id-85' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='eval_breaker' type-id='type-id-75' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_status' type-id='type-id-86' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='_whence' type-id='type-id-21' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='state' type-id='type-id-21' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='py_recursion_remaining' type-id='type-id-21' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='py_recursion_limit' type-id='type-id-21' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='c_recursion_remaining' type-id='type-id-21' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='recursion_headroom' type-id='type-id-21' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='tracing' type-id='type-id-21' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='what_event' type-id='type-id-21' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='current_frame' type-id='type-id-87' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='c_profilefunc' type-id='type-id-88' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='c_tracefunc' type-id='type-id-88' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='c_profileobj' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='c_traceobj' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='current_exception' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='exc_info' type-id='type-id-89' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='dict' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='gilstate_counter' type-id='type-id-21' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='async_exc' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='thread_id' type-id='type-id-4' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='native_thread_id' type-id='type-id-4' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='delete_later' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='critical_section' type-id='type-id-75' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='coroutine_origin_tracking_depth' type-id='type-id-21' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='async_gen_firstiter' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='async_gen_finalizer' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='context' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='context_ver' type-id='type-id-90' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='id' type-id='type-id-90' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='datastack_chunk' type-id='type-id-91' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='datastack_top' type-id='type-id-92' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='datastack_limit' type-id='type-id-92' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='exc_state' type-id='type-id-93' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='previous_executor' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='dict_global_version' type-id='type-id-90' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='threading_local_key' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='threading_local_sentinel' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='datastack_cached_chunk' type-id='type-id-91' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='204' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_typeobject' size-in-bits='3456' is-struct='yes' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='147' column='1' id='type-id-94'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-60' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tp_name' type-id='type-id-36' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tp_basicsize' type-id='type-id-46' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='tp_itemsize' type-id='type-id-46' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='tp_dealloc' type-id='type-id-95' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='tp_vectorcall_offset' type-id='type-id-46' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='tp_getattr' type-id='type-id-96' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='tp_setattr' type-id='type-id-97' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='157' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='tp_as_async' type-id='type-id-98' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='tp_repr' type-id='type-id-99' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='tp_as_number' type-id='type-id-100' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='tp_as_sequence' type-id='type-id-101' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='tp_as_mapping' type-id='type-id-102' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='tp_hash' type-id='type-id-103' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='tp_call' type-id='type-id-53' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='tp_str' type-id='type-id-99' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='tp_getattro' type-id='type-id-104' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='tp_setattro' type-id='type-id-105' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='tp_as_buffer' type-id='type-id-106' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='tp_flags' type-id='type-id-4' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='tp_doc' type-id='type-id-36' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='182' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='tp_traverse' type-id='type-id-107' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='tp_clear' type-id='type-id-54' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='tp_richcompare' type-id='type-id-108' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='tp_weaklistoffset' type-id='type-id-46' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='tp_iter' type-id='type-id-109' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='tp_iternext' type-id='type-id-110' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='tp_methods' type-id='type-id-111' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='tp_members' type-id='type-id-112' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='tp_getset' type-id='type-id-113' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='tp_base' type-id='type-id-79' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='tp_dict' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='tp_descr_get' type-id='type-id-114' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='tp_descr_set' type-id='type-id-115' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='tp_dictoffset' type-id='type-id-46' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='tp_init' type-id='type-id-116' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='tp_alloc' type-id='type-id-117' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='tp_new' type-id='type-id-118' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='tp_free' type-id='type-id-119' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='tp_is_gc' type-id='type-id-54' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='tp_bases' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='217' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='tp_mro' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='218' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='tp_cache' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='tp_subclasses' type-id='type-id-39' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='tp_weaklist' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='tp_del' type-id='type-id-95' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='tp_version_tag' type-id='type-id-70' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='tp_finalize' type-id='type-id-95' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='tp_vectorcall' type-id='type-id-120' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='tp_watched' type-id='type-id-121' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3408'>
        <var-decl name='tp_versions_used' type-id='type-id-76' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='240' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='runloom_chan' size-in-bits='1024' is-struct='yes' visibility='default' filepath='src/runloom_c/chan.c' line='85' column='1' id='type-id-122'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lock' type-id='type-id-123' visibility='default' filepath='src/runloom_c/chan.c' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='buf' type-id='type-id-92' visibility='default' filepath='src/runloom_c/chan.c' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='cap' type-id='type-id-46' visibility='default' filepath='src/runloom_c/chan.c' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='head' type-id='type-id-46' visibility='default' filepath='src/runloom_c/chan.c' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='tail' type-id='type-id-46' visibility='default' filepath='src/runloom_c/chan.c' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='len' type-id='type-id-46' visibility='default' filepath='src/runloom_c/chan.c' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='senders' type-id='type-id-124' visibility='default' filepath='src/runloom_c/chan.c' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='senders_tail' type-id='type-id-124' visibility='default' filepath='src/runloom_c/chan.c' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='receivers' type-id='type-id-124' visibility='default' filepath='src/runloom_c/chan.c' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='receivers_tail' type-id='type-id-124' visibility='default' filepath='src/runloom_c/chan.c' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='closed' type-id='type-id-21' visibility='default' filepath='src/runloom_c/chan.c' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='refcount' type-id='type-id-21' visibility='default' filepath='src/runloom_c/chan.c' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='dpor_id' type-id='type-id-90' visibility='default' filepath='src/runloom_c/chan.c' line='98' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='runloom_chan_waiter' size-in-bits='512' is-struct='yes' visibility='default' filepath='src/runloom_c/chan.c' line='54' column='1' id='type-id-125'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g' type-id='type-id-126' visibility='default' filepath='src/runloom_c/chan.c' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='hub' type-id='type-id-39' visibility='default' filepath='src/runloom_c/chan.c' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='value' type-id='type-id-2' visibility='default' filepath='src/runloom_c/chan.c' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ok' type-id='type-id-21' visibility='default' filepath='src/runloom_c/chan.c' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='send_result' type-id='type-id-21' visibility='default' filepath='src/runloom_c/chan.c' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='queued' type-id='type-id-21' visibility='default' filepath='src/runloom_c/chan.c' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='select' type-id='type-id-127' visibility='default' filepath='src/runloom_c/chan.c' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='case_index' type-id='type-id-21' visibility='default' filepath='src/runloom_c/chan.c' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='next' type-id='type-id-128' visibility='default' filepath='src/runloom_c/chan.c' line='82' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='runloom_g' size-in-bits='3968' is-struct='yes' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='172' column='1' id='type-id-129'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='coro' type-id='type-id-130' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='advice_key' type-id='type-id-82' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='req_stack_size' type-id='type-id-82' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='callable' type-id='type-id-2' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='c_entry' type-id='type-id-131' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='c_arg' type-id='type-id-39' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='result' type-id='type-id-2' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='error' type-id='type-id-2' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='snap' type-id='type-id-132' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='tstate' type-id='type-id-84' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='wake_at' type-id='type-id-13' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='sleep_seq' type-id='type-id-90' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='next' type-id='type-id-126' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='owner' type-id='type-id-133' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='done' type-id='type-id-21' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2720'>
        <var-decl name='refcount' type-id='type-id-21' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='noyield' type-id='type-id-21' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2784'>
        <var-decl name='pct_prio' type-id='type-id-21' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='226' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='pct_fifo' type-id='type-id-21' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2848'>
        <var-decl name='sleep_real' type-id='type-id-21' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='241' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='wake_pending' type-id='type-id-21' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2912'>
        <var-decl name='in_sub_queue' type-id='type-id-21' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='wake_state' type-id='type-id-21' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='netpoll_parker' type-id='type-id-39' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='313' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='iouring_op' type-id='type-id-39' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='318' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='parked_safe' type-id='type-id-21' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='park_hub' type-id='type-id-39' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='336' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='wake_next' type-id='type-id-126' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='342' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='state' type-id='type-id-121' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='350' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3336'>
        <var-decl name='arena' type-id='type-id-121' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='361' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='batch' type-id='type-id-134' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='362' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3456'>
        <var-decl name='pass_index' type-id='type-id-121' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='368' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3464'>
        <var-decl name='wait_reason' type-id='type-id-121' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='375' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3472'>
        <var-decl name='wait_reason_hint' type-id='type-id-121' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='376' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3520'>
        <var-decl name='tstate_owner_tid' type-id='type-id-4' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='386' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3584'>
        <var-decl name='id' type-id='type-id-23' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='406' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3648'>
        <var-decl name='state_since_ns' type-id='type-id-23' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='412' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3712'>
        <var-decl name='park_fd' type-id='type-id-21' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='419' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3744'>
        <var-decl name='park_events' type-id='type-id-21' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='420' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='limit_counted' type-id='type-id-121' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='424' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3840'>
        <var-decl name='reg_prev' type-id='type-id-126' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='429' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <var-decl name='reg_next' type-id='type-id-126' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='430' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='runloom_pystate_snap' size-in-bits='1856' is-struct='yes' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='65' column='1' id='type-id-135'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='valid' type-id='type-id-21' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='critical_section' type-id='type-id-75' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='context' type-id='type-id-2' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='datastack_chunk' type-id='type-id-91' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='datastack_top' type-id='type-id-92' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='datastack_limit' type-id='type-id-92' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='exc_info' type-id='type-id-89' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='exc_state' type-id='type-id-93' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='current_exception' type-id='type-id-2' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='exc_chain_bottom' type-id='type-id-89' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='exc_owners' type-id='type-id-6' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='exc_owner_count' type-id='type-id-21' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1248'>
        <var-decl name='py_recursion_remaining' type-id='type-id-21' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='c_recursion_remaining' type-id='type-id-21' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='c_profilefunc' type-id='type-id-88' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='c_tracefunc' type-id='type-id-88' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='c_profileobj' type-id='type-id-2' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='c_traceobj' type-id='type-id-2' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='tracing' type-id='type-id-21' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='current_frame' type-id='type-id-87' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='delete_later' type-id='type-id-2' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='origin_tstate' type-id='type-id-84' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='155' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='runloom_sched' size-in-bits='1728' is-struct='yes' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='505' column='1' id='type-id-136'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ready_ring' type-id='type-id-137' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='513' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ready_cap' type-id='type-id-82' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='514' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ready_mask' type-id='type-id-82' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='515' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ready_head' type-id='type-id-82' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='516' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ready_tail' type-id='type-id-82' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='517' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='current' type-id='type-id-126' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='519' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='sleep_heap' type-id='type-id-137' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='522' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='sleep_size' type-id='type-id-46' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='523' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='sleep_cap' type-id='type-id-46' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='524' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='sleep_seq_ctr' type-id='type-id-90' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='525' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='timer_heap' type-id='type-id-138' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='530' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='timer_size' type-id='type-id-46' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='531' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='timer_cap' type-id='type-id-46' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='532' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='stack_size' type-id='type-id-46' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='534' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='completed' type-id='type-id-46' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='536' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='stopping' type-id='type-id-21' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='538' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='signal_exc' type-id='type-id-2' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='544' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='netpoll_parked' type-id='type-id-21' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='551' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='wake_list_lock' type-id='type-id-123' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='558' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='wake_list_head' type-id='type-id-126' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='559' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='wake_list_tail' type-id='type-id-126' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='560' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='quiescence_head' type-id='type-id-126' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='569' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='quiescence_tail' type-id='type-id-126' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='570' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='runloom_select_case_t' size-in-bits='320' is-struct='yes' naming-typedef-id='type-id-139' visibility='default' filepath='src/runloom_c/chan.h' line='106' column='1' id='type-id-140'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ch' type-id='type-id-24' visibility='default' filepath='src/runloom_c/chan.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='op' type-id='type-id-19' visibility='default' filepath='src/runloom_c/chan.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='send_value' type-id='type-id-2' visibility='default' filepath='src/runloom_c/chan.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='recv_value' type-id='type-id-2' visibility='default' filepath='src/runloom_c/chan.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='recv_ok' type-id='type-id-21' visibility='default' filepath='src/runloom_c/chan.h' line='111' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='runloom_select_park' size-in-bits='256' is-struct='yes' visibility='default' filepath='src/runloom_c/chan_waiters.c.inc' line='39' column='1' id='type-id-141'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fired_case' type-id='type-id-142' visibility='default' filepath='src/runloom_c/chan_waiters.c.inc' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='n_cases' type-id='type-id-21' visibility='default' filepath='src/runloom_c/chan_waiters.c.inc' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fired_value' type-id='type-id-2' visibility='default' filepath='src/runloom_c/chan_waiters.c.inc' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fired_ok' type-id='type-id-21' visibility='default' filepath='src/runloom_c/chan_waiters.c.inc' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='channels' type-id='type-id-25' visibility='default' filepath='src/runloom_c/chan_waiters.c.inc' line='46' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='runloom_timer_entry_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-143' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='500' column='1' id='type-id-144'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='deadline' type-id='type-id-13' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='501' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='g' type-id='type-id-126' visibility='default' filepath='src/runloom_c/runloom_sched.h' line='502' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='71' column='1' id='type-id-86'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='initialized' type-id='type-id-70' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='bound' type-id='type-id-70' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='unbound' type-id='type-id-70' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='bound_gilstate' type-id='type-id-70' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='active' type-id='type-id-70' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='holds_gil' type-id='type-id-70' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='finalizing' type-id='type-id-70' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='cleared' type-id='type-id-70' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='finalized' type-id='type-id-70' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='92' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PyAsyncMethods' type-id='type-id-28' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='134' column='1' id='type-id-27'/>
    <typedef-decl name='PyBufferProcs' type-id='type-id-32' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='139' column='1' id='type-id-31'/>
    <typedef-decl name='PyCFunction' type-id='type-id-145' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/methodobject.h' line='19' column='1' id='type-id-48'/>
    <typedef-decl name='PyFrameObject' type-id='type-id-146' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/pytypedefs.h' line='22' column='1' id='type-id-147'/>
    <typedef-decl name='PyGetSetDef' type-id='type-id-35' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/pytypedefs.h' line='15' column='1' id='type-id-148'/>
    <typedef-decl name='PyInterpreterState' type-id='type-id-149' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/pytypedefs.h' line='25' column='1' id='type-id-150'/>
    <typedef-decl name='PyMappingMethods' type-id='type-id-41' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='125' column='1' id='type-id-40'/>
    <typedef-decl name='PyMemberDef' type-id='type-id-45' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/pytypedefs.h' line='16' column='1' id='type-id-151'/>
    <typedef-decl name='PyMethodDef' type-id='type-id-47' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/pytypedefs.h' line='14' column='1' id='type-id-152'/>
    <typedef-decl name='PyMutex' type-id='type-id-49' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/lock.h' line='31' column='1' id='type-id-77'/>
    <typedef-decl name='PyNumberMethods' type-id='type-id-52' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='105' column='1' id='type-id-51'/>
    <typedef-decl name='PyObject' type-id='type-id-74' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/pytypedefs.h' line='18' column='1' id='type-id-62'/>
    <typedef-decl name='PySendResult' type-id='type-id-15' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/object.h' line='1155' column='1' id='type-id-14'/>
    <typedef-decl name='PySequenceMethods' type-id='type-id-56' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='119' column='1' id='type-id-55'/>
    <typedef-decl name='PyThreadState' type-id='type-id-83' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/pytypedefs.h' line='24' column='1' id='type-id-153'/>
    <typedef-decl name='PyTypeObject' type-id='type-id-94' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/pytypedefs.h' line='20' column='1' id='type-id-154'/>
    <typedef-decl name='PyVarObject' type-id='type-id-61' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/object.h' line='227' column='1' id='type-id-60'/>
    <typedef-decl name='Py_buffer' type-id='type-id-64' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/pybuffer.h' line='33' column='1' id='type-id-63'/>
    <typedef-decl name='Py_hash_t' type-id='type-id-46' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/pyport.h' line='141' column='1' id='type-id-155'/>
    <typedef-decl name='Py_ssize_t' type-id='type-id-156' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/pyport.h' line='127' column='1' id='type-id-46'/>
    <typedef-decl name='Py_tracefunc' type-id='type-id-157' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='16' column='1' id='type-id-88'/>
    <typedef-decl name='_PyErr_StackItem' type-id='type-id-72' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='50' column='1' id='type-id-93'/>
    <typedef-decl name='_PyStackChunk' type-id='type-id-80' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='57' column='1' id='type-id-158'/>
    <typedef-decl name='__pthread_list_t' type-id='type-id-67' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='55' column='1' id='type-id-71'/>
    <typedef-decl name='__ssize_t' type-id='type-id-22' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='194' column='1' id='type-id-159'/>
    <typedef-decl name='__uint16_t' type-id='type-id-160' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='40' column='1' id='type-id-161'/>
    <typedef-decl name='__uint32_t' type-id='type-id-70' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='42' column='1' id='type-id-162'/>
    <typedef-decl name='__uint64_t' type-id='type-id-4' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='45' column='1' id='type-id-163'/>
    <typedef-decl name='__uint8_t' type-id='type-id-121' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='38' column='1' id='type-id-164'/>
    <typedef-decl name='allocfunc' type-id='type-id-165' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/object.h' line='492' column='1' id='type-id-117'/>
    <typedef-decl name='binaryfunc' type-id='type-id-145' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/object.h' line='462' column='1' id='type-id-43'/>
    <typedef-decl name='descrgetfunc' type-id='type-id-166' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/object.h' line='488' column='1' id='type-id-114'/>
    <typedef-decl name='descrsetfunc' type-id='type-id-167' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/object.h' line='489' column='1' id='type-id-115'/>
    <typedef-decl name='destructor' type-id='type-id-168' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/object.h' line='478' column='1' id='type-id-95'/>
    <typedef-decl name='freefunc' type-id='type-id-169' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/object.h' line='477' column='1' id='type-id-119'/>
    <typedef-decl name='getattrfunc' type-id='type-id-170' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/object.h' line='479' column='1' id='type-id-96'/>
    <typedef-decl name='getattrofunc' type-id='type-id-145' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/object.h' line='480' column='1' id='type-id-104'/>
    <typedef-decl name='getbufferproc' type-id='type-id-171' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/pybuffer.h' line='35' column='1' id='type-id-33'/>
    <typedef-decl name='getiterfunc' type-id='type-id-172' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/object.h' line='486' column='1' id='type-id-109'/>
    <typedef-decl name='getter' type-id='type-id-173' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/descrobject.h' line='8' column='1' id='type-id-37'/>
    <typedef-decl name='hashfunc' type-id='type-id-174' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/object.h' line='484' column='1' id='type-id-103'/>
    <typedef-decl name='initproc' type-id='type-id-167' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/object.h' line='490' column='1' id='type-id-116'/>
    <typedef-decl name='inquiry' type-id='type-id-175' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/object.h' line='464' column='1' id='type-id-54'/>
    <typedef-decl name='iternextfunc' type-id='type-id-172' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/object.h' line='487' column='1' id='type-id-110'/>
    <typedef-decl name='lenfunc' type-id='type-id-174' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/object.h' line='465' column='1' id='type-id-42'/>
    <typedef-decl name='newfunc' type-id='type-id-176' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/object.h' line='491' column='1' id='type-id-118'/>
    <typedef-decl name='objobjargproc' type-id='type-id-167' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/object.h' line='470' column='1' id='type-id-44'/>
    <typedef-decl name='objobjproc' type-id='type-id-177' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/object.h' line='472' column='1' id='type-id-59'/>
    <typedef-decl name='pthread_mutex_t' type-id='type-id-178' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='72' column='1' id='type-id-179'/>
    <typedef-decl name='pthread_mutexattr_t' type-id='type-id-180' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='36' column='1' id='type-id-181'/>
    <typedef-decl name='releasebufferproc' type-id='type-id-182' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/pybuffer.h' line='36' column='1' id='type-id-34'/>
    <typedef-decl name='reprfunc' type-id='type-id-172' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/object.h' line='483' column='1' id='type-id-99'/>
    <typedef-decl name='richcmpfunc' type-id='type-id-183' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/object.h' line='485' column='1' id='type-id-108'/>
    <typedef-decl name='runloom_c_entry_fn' type-id='type-id-169' filepath='src/runloom_c/runloom_sched.h' line='170' column='1' id='type-id-131'/>
    <typedef-decl name='runloom_chan_t' type-id='type-id-122' filepath='src/runloom_c/chan.h' line='40' column='1' id='type-id-184'/>
    <typedef-decl name='runloom_chan_waiter_t' type-id='type-id-125' filepath='src/runloom_c/chan.c' line='83' column='1' id='type-id-185'/>
    <typedef-decl name='runloom_coro_t' type-id='type-id-186' filepath='src/runloom_c/coro.h' line='23' column='1' id='type-id-187'/>
    <typedef-decl name='runloom_evt_op_t' type-id='type-id-17' filepath='src/runloom_c/runloom_diag.h' line='87' column='1' id='type-id-188'/>
    <typedef-decl name='runloom_g_state_t' type-id='type-id-18' filepath='src/runloom_c/runloom_gstate.h' line='57' column='1' id='type-id-189'/>
    <typedef-decl name='runloom_g_t' type-id='type-id-129' filepath='src/runloom_c/runloom_sched.h' line='23' column='1' id='type-id-190'/>
    <typedef-decl name='runloom_mutex_t' type-id='type-id-179' filepath='src/runloom_c/plat_compat.h' line='81' column='1' id='type-id-123'/>
    <typedef-decl name='runloom_pystate_snap_t' type-id='type-id-135' filepath='src/runloom_c/runloom_sched.h' line='25' column='1' id='type-id-132'/>
    <typedef-decl name='runloom_sched_t' type-id='type-id-136' filepath='src/runloom_c/runloom_sched.h' line='24' column='1' id='type-id-191'/>
    <typedef-decl name='runloom_select_case_t' type-id='type-id-140' filepath='src/runloom_c/chan.h' line='112' column='1' id='type-id-139'/>
    <typedef-decl name='runloom_select_op_t' type-id='type-id-20' filepath='src/runloom_c/chan.h' line='104' column='1' id='type-id-19'/>
    <typedef-decl name='runloom_timer_entry_t' type-id='type-id-144' filepath='src/runloom_c/runloom_sched.h' line='503' column='1' id='type-id-143'/>
    <typedef-decl name='sendfunc' type-id='type-id-192' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/object.h' line='127' column='1' id='type-id-30'/>
    <typedef-decl name='setattrfunc' type-id='type-id-193' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/object.h' line='481' column='1' id='type-id-97'/>
    <typedef-decl name='setattrofunc' type-id='type-id-167' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/object.h' line='482' column='1' id='type-id-105'/>
    <typedef-decl name='setter' type-id='type-id-194' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/descrobject.h' line='9' column='1' id='type-id-38'/>
    <typedef-decl name='size_t' type-id='type-id-4' filepath='/usr/lib/gcc/x86_64-linux-gnu/13/include/stddef.h' line='214' column='1' id='type-id-82'/>
    <typedef-decl name='ssize_t' type-id='type-id-159' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='108' column='1' id='type-id-156'/>
    <typedef-decl name='ssizeargfunc' type-id='type-id-195' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/object.h' line='466' column='1' id='type-id-57'/>
    <typedef-decl name='ssizeobjargproc' type-id='type-id-196' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/object.h' line='468' column='1' id='type-id-58'/>
    <typedef-decl name='ternaryfunc' type-id='type-id-166' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/object.h' line='463' column='1' id='type-id-53'/>
    <typedef-decl name='traverseproc' type-id='type-id-197' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/object.h' line='474' column='1' id='type-id-107'/>
    <typedef-decl name='uint16_t' type-id='type-id-161' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='25' column='1' id='type-id-76'/>
    <typedef-decl name='uint32_t' type-id='type-id-162' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='26' column='1' id='type-id-78'/>
    <typedef-decl name='uint64_t' type-id='type-id-163' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='27' column='1' id='type-id-90'/>
    <typedef-decl name='uint8_t' type-id='type-id-164' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='24' column='1' id='type-id-50'/>
    <typedef-decl name='uintptr_t' type-id='type-id-4' filepath='/usr/include/stdint.h' line='79' column='1' id='type-id-75'/>
    <typedef-decl name='unaryfunc' type-id='type-id-172' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/object.h' line='461' column='1' id='type-id-29'/>
    <typedef-decl name='vectorcallfunc' type-id='type-id-198' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/object.h' line='495' column='1' id='type-id-120'/>
    <typedef-decl name='visitproc' type-id='type-id-199' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/object.h' line='473' column='1' id='type-id-200'/>
    <union-decl name='pthread_mutex_t' size-in-bits='320' naming-typedef-id='type-id-179' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='67' column='1' id='type-id-178'>
      <data-member access='public'>
        <var-decl name='__data' type-id='type-id-69' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='69' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-9' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='70' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-22' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='71' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='pthread_mutexattr_t' size-in-bits='32' naming-typedef-id='type-id-181' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='32' column='1' id='type-id-180'>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-11' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='34' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-21' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='35' column='1'/>
      </data-member>
    </union-decl>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-16'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-121'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-70'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-4'/>
    <type-decl name='unsigned long long int' size-in-bits='64' id='type-id-201'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-160'/>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-98'/>
    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-106'/>
    <pointer-type-def type-id='type-id-147' size-in-bits='64' id='type-id-202'/>
    <pointer-type-def type-id='type-id-148' size-in-bits='64' id='type-id-113'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-85'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-102'/>
    <pointer-type-def type-id='type-id-151' size-in-bits='64' id='type-id-112'/>
    <pointer-type-def type-id='type-id-152' size-in-bits='64' id='type-id-111'/>
    <pointer-type-def type-id='type-id-51' size-in-bits='64' id='type-id-100'/>
    <pointer-type-def type-id='type-id-62' size-in-bits='64' id='type-id-2'/>
    <pointer-type-def type-id='type-id-203' size-in-bits='64' id='type-id-172'/>
    <pointer-type-def type-id='type-id-204' size-in-bits='64' id='type-id-198'/>
    <pointer-type-def type-id='type-id-205' size-in-bits='64' id='type-id-145'/>
    <pointer-type-def type-id='type-id-206' size-in-bits='64' id='type-id-166'/>
    <pointer-type-def type-id='type-id-207' size-in-bits='64' id='type-id-183'/>
    <pointer-type-def type-id='type-id-208' size-in-bits='64' id='type-id-170'/>
    <pointer-type-def type-id='type-id-209' size-in-bits='64' id='type-id-195'/>
    <pointer-type-def type-id='type-id-210' size-in-bits='64' id='type-id-173'/>
    <pointer-type-def type-id='type-id-211' size-in-bits='64' id='type-id-176'/>
    <pointer-type-def type-id='type-id-212' size-in-bits='64' id='type-id-165'/>
    <qualified-type-def type-id='type-id-2' const='yes' id='type-id-213'/>
    <pointer-type-def type-id='type-id-213' size-in-bits='64' id='type-id-214'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-92'/>
    <pointer-type-def type-id='type-id-55' size-in-bits='64' id='type-id-101'/>
    <pointer-type-def type-id='type-id-153' size-in-bits='64' id='type-id-84'/>
    <pointer-type-def type-id='type-id-154' size-in-bits='64' id='type-id-79'/>
    <pointer-type-def type-id='type-id-63' size-in-bits='64' id='type-id-215'/>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-66'/>
    <pointer-type-def type-id='type-id-93' size-in-bits='64' id='type-id-89'/>
    <pointer-type-def type-id='type-id-216' size-in-bits='64' id='type-id-87'/>
    <pointer-type-def type-id='type-id-158' size-in-bits='64' id='type-id-91'/>
    <pointer-type-def type-id='type-id-67' size-in-bits='64' id='type-id-68'/>
    <pointer-type-def type-id='type-id-72' size-in-bits='64' id='type-id-73'/>
    <pointer-type-def type-id='type-id-80' size-in-bits='64' id='type-id-81'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-65'/>
    <qualified-type-def type-id='type-id-8' const='yes' id='type-id-217'/>
    <pointer-type-def type-id='type-id-217' size-in-bits='64' id='type-id-36'/>
    <qualified-type-def type-id='type-id-181' const='yes' id='type-id-218'/>
    <pointer-type-def type-id='type-id-218' size-in-bits='64' id='type-id-219'/>
    <pointer-type-def type-id='type-id-220' size-in-bits='64' id='type-id-175'/>
    <pointer-type-def type-id='type-id-221' size-in-bits='64' id='type-id-157'/>
    <pointer-type-def type-id='type-id-222' size-in-bits='64' id='type-id-177'/>
    <pointer-type-def type-id='type-id-223' size-in-bits='64' id='type-id-167'/>
    <pointer-type-def type-id='type-id-224' size-in-bits='64' id='type-id-194'/>
    <pointer-type-def type-id='type-id-225' size-in-bits='64' id='type-id-171'/>
    <pointer-type-def type-id='type-id-226' size-in-bits='64' id='type-id-193'/>
    <pointer-type-def type-id='type-id-227' size-in-bits='64' id='type-id-196'/>
    <pointer-type-def type-id='type-id-228' size-in-bits='64' id='type-id-197'/>
    <pointer-type-def type-id='type-id-229' size-in-bits='64' id='type-id-199'/>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-230'/>
    <pointer-type-def type-id='type-id-179' size-in-bits='64' id='type-id-231'/>
    <pointer-type-def type-id='type-id-184' size-in-bits='64' id='type-id-24'/>
    <pointer-type-def type-id='type-id-125' size-in-bits='64' id='type-id-128'/>
    <pointer-type-def type-id='type-id-185' size-in-bits='64' id='type-id-124'/>
    <pointer-type-def type-id='type-id-187' size-in-bits='64' id='type-id-130'/>
    <pointer-type-def type-id='type-id-232' size-in-bits='64' id='type-id-134'/>
    <pointer-type-def type-id='type-id-129' size-in-bits='64' id='type-id-233'/>
    <pointer-type-def type-id='type-id-190' size-in-bits='64' id='type-id-126'/>
    <pointer-type-def type-id='type-id-126' size-in-bits='64' id='type-id-137'/>
    <pointer-type-def type-id='type-id-191' size-in-bits='64' id='type-id-133'/>
    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-234'/>
    <pointer-type-def type-id='type-id-141' size-in-bits='64' id='type-id-127'/>
    <pointer-type-def type-id='type-id-143' size-in-bits='64' id='type-id-138'/>
    <pointer-type-def type-id='type-id-235' size-in-bits='64' id='type-id-192'/>
    <pointer-type-def type-id='type-id-236' size-in-bits='64' id='type-id-174'/>
    <pointer-type-def type-id='type-id-237' size-in-bits='64' id='type-id-168'/>
    <pointer-type-def type-id='type-id-238' size-in-bits='64' id='type-id-182'/>
    <pointer-type-def type-id='type-id-239' size-in-bits='64' id='type-id-169'/>
    <qualified-type-def type-id='type-id-21' volatile='yes' id='type-id-142'/>
    <class-decl name='_PyInterpreterFrame' size-in-bits='640' is-struct='yes' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_frame.h' line='62' column='1' id='type-id-216'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='f_executable' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_frame.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='previous' type-id='type-id-87' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_frame.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='f_funcobj' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_frame.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='f_globals' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_frame.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='f_builtins' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_frame.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='f_locals' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_frame.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='frame_obj' type-id='type-id-202' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_frame.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='instr_ptr' type-id='type-id-240' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_frame.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='stacktop' type-id='type-id-21' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_frame.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='return_offset' type-id='type-id-76' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_frame.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='560'>
        <var-decl name='owner' type-id='type-id-8' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_frame.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='localsplus' type-id='type-id-3' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_frame.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_frame' size-in-bits='704' is-struct='yes' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_frame.h' line='21' column='1' id='type-id-146'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-62' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_frame.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='f_back' type-id='type-id-202' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_frame.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='f_frame' type-id='type-id-87' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_frame.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='f_trace' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_frame.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='f_lineno' type-id='type-id-21' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_frame.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='f_trace_lines' type-id='type-id-8' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_frame.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='488'>
        <var-decl name='f_trace_opcodes' type-id='type-id-8' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_frame.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='f_extra_locals' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_frame.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='f_locals_cache' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_frame.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_f_frame_data' type-id='type-id-3' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_frame.h' line='35' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_is' size-in-bits='1724928' is-struct='yes' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='94' column='1' id='type-id-149'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ceval' type-id='type-id-241' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='58112'>
        <var-decl name='next' type-id='type-id-85' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='58176'>
        <var-decl name='id' type-id='type-id-242' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='58240'>
        <var-decl name='id_refcount' type-id='type-id-242' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='58304'>
        <var-decl name='requires_idref' type-id='type-id-21' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='58368'>
        <var-decl name='id_mutex' type-id='type-id-243' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='58432'>
        <var-decl name='_whence' type-id='type-id-22' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='58496'>
        <var-decl name='_initialized' type-id='type-id-21' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='58528'>
        <var-decl name='_ready' type-id='type-id-21' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='58560'>
        <var-decl name='finalizing' type-id='type-id-21' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='58624'>
        <var-decl name='last_restart_version' type-id='type-id-75' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='58688'>
        <var-decl name='threads' type-id='type-id-244' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='59008'>
        <var-decl name='runtime' type-id='type-id-245' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='59072'>
        <var-decl name='_finalizing' type-id='type-id-84' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='59136'>
        <var-decl name='_finalizing_id' type-id='type-id-4' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='59200'>
        <var-decl name='gc' type-id='type-id-246' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='157' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='61184'>
        <var-decl name='sysdict' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='61248'>
        <var-decl name='builtins' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='61312'>
        <var-decl name='imports' type-id='type-id-247' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='62080'>
        <var-decl name='_gil' type-id='type-id-248' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='63808'>
        <var-decl name='codecs' type-id='type-id-249' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64064'>
        <var-decl name='config' type-id='type-id-250' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='67648'>
        <var-decl name='feature_flags' type-id='type-id-4' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='67712'>
        <var-decl name='dict' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='67776'>
        <var-decl name='sysdict_copy' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='67840'>
        <var-decl name='builtins_copy' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='67904'>
        <var-decl name='eval_frame' type-id='type-id-251' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='67968'>
        <var-decl name='func_watchers' type-id='type-id-252' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='68480'>
        <var-decl name='active_func_watchers' type-id='type-id-50' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='68544'>
        <var-decl name='co_extra_user_count' type-id='type-id-46' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='68608'>
        <var-decl name='co_extra_freefuncs' type-id='type-id-253' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='84928'>
        <var-decl name='xi' type-id='type-id-254' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='85184'>
        <var-decl name='before_forkers' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='85248'>
        <var-decl name='after_forkers_parent' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='85312'>
        <var-decl name='after_forkers_child' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='85376'>
        <var-decl name='warnings' type-id='type-id-255' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='85696'>
        <var-decl name='atexit' type-id='type-id-256' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='85952'>
        <var-decl name='stoptheworld' type-id='type-id-257' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='217' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='86144'>
        <var-decl name='qsbr' type-id='type-id-258' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='218' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='86528'>
        <var-decl name='mimalloc' type-id='type-id-259' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='89088'>
        <var-decl name='brc' type-id='type-id-260' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='138432'>
        <var-decl name='weakref_locks' type-id='type-id-261' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='223' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='139456'>
        <var-decl name='obmalloc' type-id='type-id-262' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='139520'>
        <var-decl name='audit_hooks' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='139584'>
        <var-decl name='type_watchers' type-id='type-id-263' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='239' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='140096'>
        <var-decl name='code_watchers' type-id='type-id-264' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='140608'>
        <var-decl name='active_code_watchers' type-id='type-id-50' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='140640'>
        <var-decl name='object_state' type-id='type-id-265' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='140672'>
        <var-decl name='unicode' type-id='type-id-266' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='141120'>
        <var-decl name='long_state' type-id='type-id-267' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='141184'>
        <var-decl name='dtoa' type-id='type-id-268' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160704'>
        <var-decl name='func_state' type-id='type-id-269' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='685056'>
        <var-decl name='code_state' type-id='type-id-270' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='685184'>
        <var-decl name='dict_state' type-id='type-id-271' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='685824'>
        <var-decl name='exc_state' type-id='type-id-272' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='686080'>
        <var-decl name='mem_free_queue' type-id='type-id-273' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='686272'>
        <var-decl name='ast' type-id='type-id-274' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='701888'>
        <var-decl name='types' type-id='type-id-275' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1569280'>
        <var-decl name='callable_cache' type-id='type-id-276' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1569536'>
        <var-decl name='optimizer' type-id='type-id-277' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1569600'>
        <var-decl name='executor_list_head' type-id='type-id-278' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1569664'>
        <var-decl name='rare_events' type-id='type-id-279' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1569728'>
        <var-decl name='builtins_dict_watcher' type-id='type-id-280' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1569792'>
        <var-decl name='monitors' type-id='type-id-281' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1569912'>
        <var-decl name='sys_profile_once_flag' type-id='type-id-282' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1569920'>
        <var-decl name='sys_trace_once_flag' type-id='type-id-282' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1569984'>
        <var-decl name='sys_profiling_threads' type-id='type-id-46' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1570048'>
        <var-decl name='sys_tracing_threads' type-id='type-id-46' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1570112'>
        <var-decl name='monitoring_callables' type-id='type-id-283' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1578816'>
        <var-decl name='monitoring_tool_names' type-id='type-id-6' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1579328'>
        <var-decl name='cached_objects' type-id='type-id-284' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1580608'>
        <var-decl name='static_objects' type-id='type-id-285' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='273' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1581952'>
        <var-decl name='_initial_thread' type-id='type-id-286' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='276' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1724544'>
        <var-decl name='_interactive_src_count' type-id='type-id-46' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='277' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1724608'>
        <var-decl name='threads_preallocated' type-id='type-id-287' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/internal/pycore_interp.h' line='279' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='runloom_coro' size-in-bits='768' is-struct='yes' visibility='default' filepath='src/runloom_c/coro.c' line='102' column='1' id='type-id-186'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='entry' type-id='type-id-288' visibility='default' filepath='src/runloom_c/coro.c' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='user' type-id='type-id-39' visibility='default' filepath='src/runloom_c/coro.c' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='done' type-id='type-id-21' visibility='default' filepath='src/runloom_c/coro.c' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='dbg_running' type-id='type-id-21' visibility='default' filepath='src/runloom_c/coro.c' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='pool_next' type-id='type-id-289' visibility='default' filepath='src/runloom_c/coro.c' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='asm_coro' type-id='type-id-290' visibility='default' filepath='src/runloom_c/coro.c' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='stack' type-id='type-id-39' visibility='default' filepath='src/runloom_c/coro.c' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='stack_size' type-id='type-id-82' visibility='default' filepath='src/runloom_c/coro.c' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='grown' type-id='type-id-21' visibility='default' filepath='src/runloom_c/coro.c' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='fresh' type-id='type-id-21' visibility='default' filepath='src/runloom_c/coro.c' line='126' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='runloom_fibern_batch' size-in-bits='448' is-struct='yes' visibility='default' filepath='src/runloom_c/mn_sched_init_fini.c.inc' line='705' column='1' id='type-id-232'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='garena' type-id='type-id-39' visibility='default' filepath='src/runloom_c/mn_sched_init_fini.c.inc' line='706' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='carena' type-id='type-id-39' visibility='default' filepath='src/runloom_c/mn_sched_init_fini.c.inc' line='707' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='start_slot' type-id='type-id-82' visibility='default' filepath='src/runloom_c/mn_sched_init_fini.c.inc' line='708' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nslots' type-id='type-id-22' visibility='default' filepath='src/runloom_c/mn_sched_init_fini.c.inc' line='709' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='stack_size' type-id='type-id-82' visibility='default' filepath='src/runloom_c/mn_sched_init_fini.c.inc' line='710' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='node' type-id='type-id-21' visibility='default' filepath='src/runloom_c/mn_sched_init_fini.c.inc' line='711' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='live' type-id='type-id-22' visibility='default' filepath='src/runloom_c/mn_sched_init_fini.c.inc' line='712' column='1'/>
      </data-member>
    </class-decl>
    <function-decl name='_Py_DecRefShared' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/object.h' line='852' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_MergeZeroLocalRefcount' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/object.h' line='859' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyErr_SetString' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/pyerrors.h' line='11' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-36'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyErr_Occurred' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/pyerrors.h' line='15' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='PyErr_NoMemory' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/pyerrors.h' line='167' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='PyMem_Calloc' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/pymem.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-82'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='PyMem_Free' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/pymem.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_mutex_init' filepath='/usr/include/pthread.h' line='781' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-231'/>
      <parameter type-id='type-id-219'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='pthread_mutex_destroy' filepath='/usr/include/pthread.h' line='786' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-231'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='pthread_mutex_lock' filepath='/usr/include/pthread.h' line='794' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-231'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='pthread_mutex_unlock' filepath='/usr/include/pthread.h' line='835' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-231'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='runloom_chan_send' mangled-name='runloom_chan_send' filepath='src/runloom_c/chan_ops.c.inc' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_chan_send'>
      <parameter type-id='type-id-24' name='ch' filepath='src/runloom_c/chan_ops.c.inc' line='96' column='1'/>
      <parameter type-id='type-id-2' name='value' filepath='src/runloom_c/chan_ops.c.inc' line='96' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='runloom_chan_try_send' mangled-name='runloom_chan_try_send' filepath='src/runloom_c/chan_ops.c.inc' line='103' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_chan_try_send'>
      <parameter type-id='type-id-24' name='ch' filepath='src/runloom_c/chan_ops.c.inc' line='103' column='1'/>
      <parameter type-id='type-id-2' name='value' filepath='src/runloom_c/chan_ops.c.inc' line='103' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='runloom_chan_recv' mangled-name='runloom_chan_recv' filepath='src/runloom_c/chan_ops.c.inc' line='198' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_chan_recv'>
      <parameter type-id='type-id-24' name='ch' filepath='src/runloom_c/chan_ops.c.inc' line='198' column='1'/>
      <parameter type-id='type-id-230' name='ok' filepath='src/runloom_c/chan_ops.c.inc' line='198' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='runloom_chan_try_recv' mangled-name='runloom_chan_try_recv' filepath='src/runloom_c/chan_ops.c.inc' line='205' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_chan_try_recv'>
      <parameter type-id='type-id-24' name='ch' filepath='src/runloom_c/chan_ops.c.inc' line='205' column='1'/>
      <parameter type-id='type-id-92' name='out' filepath='src/runloom_c/chan_ops.c.inc' line='205' column='1'/>
      <parameter type-id='type-id-230' name='ok' filepath='src/runloom_c/chan_ops.c.inc' line='205' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='runloom_chan_close' mangled-name='runloom_chan_close' filepath='src/runloom_c/chan_ops.c.inc' line='214' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_chan_close'>
      <parameter type-id='type-id-24' name='ch' filepath='src/runloom_c/chan_ops.c.inc' line='214' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='runloom_chan_is_closed' mangled-name='runloom_chan_is_closed' filepath='src/runloom_c/chan_ops.c.inc' line='245' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_chan_is_closed'>
      <parameter type-id='type-id-24' name='ch' filepath='src/runloom_c/chan_ops.c.inc' line='245' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='runloom_chan_len' mangled-name='runloom_chan_len' filepath='src/runloom_c/chan_ops.c.inc' line='254' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_chan_len'>
      <parameter type-id='type-id-24' name='ch' filepath='src/runloom_c/chan_ops.c.inc' line='254' column='1'/>
      <return type-id='type-id-46'/>
    </function-decl>
    <function-decl name='runloom_chan_cap' mangled-name='runloom_chan_cap' filepath='src/runloom_c/chan_ops.c.inc' line='263' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_chan_cap'>
      <parameter type-id='type-id-24' name='ch' filepath='src/runloom_c/chan_ops.c.inc' line='263' column='1'/>
      <return type-id='type-id-46'/>
    </function-decl>
    <function-decl name='runloom_chan_select' mangled-name='runloom_chan_select' filepath='src/runloom_c/chan_select_main.c.inc' line='6' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_chan_select'>
      <parameter type-id='type-id-234' name='cases' filepath='src/runloom_c/chan_select_main.c.inc' line='6' column='1'/>
      <parameter type-id='type-id-21' name='n' filepath='src/runloom_c/chan_select_main.c.inc' line='6' column='1'/>
      <parameter type-id='type-id-21' name='default_ready' filepath='src/runloom_c/chan_select_main.c.inc' line='6' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='runloom_chan_new' mangled-name='runloom_chan_new' filepath='src/runloom_c/chan_waiters.c.inc' line='107' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_chan_new'>
      <parameter type-id='type-id-46' name='cap' filepath='src/runloom_c/chan_waiters.c.inc' line='107' column='1'/>
      <return type-id='type-id-24'/>
    </function-decl>
    <function-decl name='runloom_chan_incref' mangled-name='runloom_chan_incref' filepath='src/runloom_c/chan_waiters.c.inc' line='134' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_chan_incref'>
      <parameter type-id='type-id-24' name='ch' filepath='src/runloom_c/chan_waiters.c.inc' line='134' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='runloom_chan_decref' mangled-name='runloom_chan_decref' filepath='src/runloom_c/chan_waiters.c.inc' line='139' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_chan_decref'>
      <parameter type-id='type-id-24' name='ch' filepath='src/runloom_c/chan_waiters.c.inc' line='139' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='runloom_coro_yield' filepath='src/runloom_c/coro.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='runloom_mn_current_hub_opaque' filepath='src/runloom_c/mn_sched.h' line='161' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='runloom_mn_tls_current_g' filepath='src/runloom_c/mn_sched.h' line='191' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-126'/>
    </function-decl>
    <function-decl name='runloom_mn_wake_g' filepath='src/runloom_c/mn_sched.h' line='219' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-126'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='runloom_mn_seg_touch' filepath='src/runloom_c/mn_sched.h' line='256' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-201'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='runloom_evt_log_' filepath='src/runloom_c/runloom_diag.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-188'/>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='runloom_g_state_set' filepath='src/runloom_c/runloom_gstate.h' line='96' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-233'/>
      <parameter type-id='type-id-189'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='runloom_sched_get' filepath='src/runloom_c/runloom_sched.h' line='590' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-133'/>
    </function-decl>
    <function-decl name='runloom_sched_peek_current' filepath='src/runloom_c/runloom_sched.h' line='593' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-126'/>
    </function-decl>
    <function-decl name='runloom_sched_park_current' filepath='src/runloom_c/runloom_sched.h' line='678' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='runloom_sched_wake' filepath='src/runloom_c/runloom_sched.h' line='723' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-126'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-1' id='type-id-39'/>
    <function-type size-in-bits='64' id='type-id-203'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-204'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-214'/>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-205'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-206'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-207'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-208'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-65'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-209'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-46'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-210'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-211'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-212'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-46'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-235'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-92'/>
      <return type-id='type-id-14'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-220'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-21'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-236'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-46'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-221'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-21'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-222'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-21'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-223'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-21'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-224'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-21'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-225'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-215'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-21'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-226'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-65'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-21'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-228'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-200'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-21'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-227'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-21'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-229'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-21'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-237'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-238'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-215'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-239'>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-1'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='src/runloom_c/cldeque.c' language='LANG_C11'>
    <class-decl name='runloom_cldeque' size-in-bits='262272' is-struct='yes' visibility='default' filepath='src/runloom_c/cldeque.h' line='28' column='1' id='type-id-291'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='top' type-id='type-id-292' visibility='default' filepath='src/runloom_c/cldeque.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bottom' type-id='type-id-292' visibility='default' filepath='src/runloom_c/cldeque.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='buf' type-id='type-id-293' visibility='default' filepath='src/runloom_c/cldeque.h' line='33' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='runloom_cldeque_t' type-id='type-id-291' filepath='src/runloom_c/cldeque.h' line='34' column='1' id='type-id-294'/>
    <array-type-def dimensions='1' type-id='type-id-39' id='type-id-293'>
      <subrange length='4096' lower-bound='0' upper-bound='4095' type-id='type-id-4' id='type-id-295'/>
    </array-type-def>
    <qualified-type-def type-id='type-id-294' const='yes' id='type-id-296'/>
    <pointer-type-def type-id='type-id-296' size-in-bits='64' id='type-id-297'/>
    <pointer-type-def type-id='type-id-294' size-in-bits='64' id='type-id-298'/>
    <qualified-type-def type-id='type-id-22' volatile='yes' id='type-id-292'/>
    <function-decl name='runloom_cldeque_init' mangled-name='runloom_cldeque_init' filepath='src/runloom_c/cldeque.c' line='29' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_cldeque_init'>
      <parameter type-id='type-id-298' name='d' filepath='src/runloom_c/cldeque.c' line='29' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='runloom_cldeque_push' mangled-name='runloom_cldeque_push' filepath='src/runloom_c/cldeque.c' line='35' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_cldeque_push'>
      <parameter type-id='type-id-298' name='d' filepath='src/runloom_c/cldeque.c' line='35' column='1'/>
      <parameter type-id='type-id-39' name='item' filepath='src/runloom_c/cldeque.c' line='35' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='runloom_cldeque_pop' mangled-name='runloom_cldeque_pop' filepath='src/runloom_c/cldeque.c' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_cldeque_pop'>
      <parameter type-id='type-id-298' name='d' filepath='src/runloom_c/cldeque.c' line='46' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='runloom_cldeque_steal' mangled-name='runloom_cldeque_steal' filepath='src/runloom_c/cldeque.c' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_cldeque_steal'>
      <parameter type-id='type-id-298' name='d' filepath='src/runloom_c/cldeque.c' line='82' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='runloom_cldeque_size' mangled-name='runloom_cldeque_size' filepath='src/runloom_c/cldeque.c' line='103' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_cldeque_size'>
      <parameter type-id='type-id-297' name='d' filepath='src/runloom_c/cldeque.c' line='103' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/runloom_c/coro.c' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-8' size-in-bits='8' id='type-id-299'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-4' id='type-id-5'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-8' size-in-bits='160' id='type-id-300'>
      <subrange length='20' lower-bound='0' upper-bound='19' type-id='type-id-4' id='type-id-301'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-8' size-in-bits='448' id='type-id-302'>
      <subrange length='56' lower-bound='0' upper-bound='55' type-id='type-id-4' id='type-id-303'/>
    </array-type-def>
    <enum-decl name='runloom_delay_site' filepath='src/runloom_c/runloom_diag.h' line='149' column='1' id='type-id-304'>
      <underlying-type type-id='type-id-16'/>
      <enumerator name='RUNLOOM_DLY_PAINT' value='0'/>
      <enumerator name='RUNLOOM_DLY_CAL_FREEZE' value='1'/>
      <enumerator name='RUNLOOM_DLY_CORO_ACQUIRE' value='2'/>
      <enumerator name='RUNLOOM_DLY_CORO_RELEASE' value='3'/>
      <enumerator name='RUNLOOM_DLY_HANDOFF_ADOPT' value='4'/>
      <enumerator name='RUNLOOM_DLY_WORLD_YIELD' value='5'/>
      <enumerator name='RUNLOOM_DLY_SNAP_SAVE' value='6'/>
      <enumerator name='RUNLOOM_DLY_SNAP_LOAD' value='7'/>
      <enumerator name='RUNLOOM_DLY_G_ENTRY' value='8'/>
      <enumerator name='RUNLOOM_DLY_G_COMPLETE' value='9'/>
      <enumerator name='RUNLOOM_DLY_HUB_RESUME' value='10'/>
      <enumerator name='RUNLOOM_DLY_NSITES' value='11'/>
    </enum-decl>
    <type-decl name='signed char' size-in-bits='8' id='type-id-305'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='49' column='1' id='type-id-306'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-21' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-65' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-65' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-65' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-65' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-65' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-65' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-65' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-65' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-65' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-65' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-65' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-307' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-308' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-21' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-21' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-309' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-160' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-305' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-299' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-310' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-311' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-312' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-313' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-308' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-39' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-82' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-21' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-300' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='runloom_asm_coro' size-in-bits='320' is-struct='yes' visibility='default' filepath='src/runloom_c/fcontext.h' line='44' column='1' id='type-id-314'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='self' type-id='type-id-315' visibility='default' filepath='src/runloom_c/fcontext.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='caller' type-id='type-id-315' visibility='default' filepath='src/runloom_c/fcontext.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='entry' type-id='type-id-169' visibility='default' filepath='src/runloom_c/fcontext.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='user' type-id='type-id-39' visibility='default' filepath='src/runloom_c/fcontext.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='done' type-id='type-id-21' visibility='default' filepath='src/runloom_c/fcontext.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='runloom_asm_ctx' size-in-bits='64' is-struct='yes' visibility='default' filepath='src/runloom_c/fcontext.h' line='38' column='1' id='type-id-316'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sp' type-id='type-id-39' visibility='default' filepath='src/runloom_c/fcontext.h' line='39' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='runloom_coro' size-in-bits='768' is-struct='yes' visibility='default' filepath='src/runloom_c/coro.c' line='102' column='1' id='type-id-186'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='entry' type-id='type-id-288' visibility='default' filepath='src/runloom_c/coro.c' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='user' type-id='type-id-39' visibility='default' filepath='src/runloom_c/coro.c' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='done' type-id='type-id-21' visibility='default' filepath='src/runloom_c/coro.c' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='dbg_running' type-id='type-id-21' visibility='default' filepath='src/runloom_c/coro.c' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='pool_next' type-id='type-id-289' visibility='default' filepath='src/runloom_c/coro.c' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='asm_coro' type-id='type-id-290' visibility='default' filepath='src/runloom_c/coro.c' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='stack' type-id='type-id-39' visibility='default' filepath='src/runloom_c/coro.c' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='stack_size' type-id='type-id-82' visibility='default' filepath='src/runloom_c/coro.c' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='grown' type-id='type-id-21' visibility='default' filepath='src/runloom_c/coro.c' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='fresh' type-id='type-id-21' visibility='default' filepath='src/runloom_c/coro.c' line='126' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h' line='11' column='1' id='type-id-317'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-318' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-319' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h' line='21' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='type-id-306' filepath='/usr/include/x86_64-linux-gnu/bits/types/FILE.h' line='7' column='1' id='type-id-320'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-1' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='43' column='1' id='type-id-321'/>
    <typedef-decl name='__clockid_t' type-id='type-id-21' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='169' column='1' id='type-id-322'/>
    <typedef-decl name='__off64_t' type-id='type-id-22' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='153' column='1' id='type-id-311'/>
    <typedef-decl name='__off_t' type-id='type-id-22' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='152' column='1' id='type-id-309'/>
    <typedef-decl name='__syscall_slong_t' type-id='type-id-22' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='197' column='1' id='type-id-319'/>
    <typedef-decl name='__time_t' type-id='type-id-22' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='160' column='1' id='type-id-318'/>
    <typedef-decl name='clockid_t' type-id='type-id-322' filepath='/usr/include/x86_64-linux-gnu/bits/types/clockid_t.h' line='7' column='1' id='type-id-323'/>
    <typedef-decl name='pthread_attr_t' type-id='type-id-324' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='62' column='1' id='type-id-325'/>
    <typedef-decl name='pthread_t' type-id='type-id-4' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='27' column='1' id='type-id-326'/>
    <typedef-decl name='runloom_asm_coro_t' type-id='type-id-314' filepath='src/runloom_c/fcontext.h' line='42' column='1' id='type-id-290'/>
    <typedef-decl name='runloom_asm_ctx_t' type-id='type-id-316' filepath='src/runloom_c/fcontext.h' line='40' column='1' id='type-id-315'/>
    <typedef-decl name='runloom_delay_site_t' type-id='type-id-304' filepath='src/runloom_c/runloom_diag.h' line='162' column='1' id='type-id-327'/>
    <typedef-decl name='runloom_entry_fn' type-id='type-id-169' filepath='src/runloom_c/coro.h' line='25' column='1' id='type-id-288'/>
    <union-decl name='pthread_attr_t' size-in-bits='448' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='56' column='1' id='type-id-324'>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-302' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='58' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-22' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='59' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-320' size-in-bits='64' id='type-id-328'/>
    <qualified-type-def type-id='type-id-328' restrict='yes' id='type-id-329'/>
    <pointer-type-def type-id='type-id-306' size-in-bits='64' id='type-id-308'/>
    <qualified-type-def type-id='type-id-65' restrict='yes' id='type-id-330'/>
    <pointer-type-def type-id='type-id-65' size-in-bits='64' id='type-id-331'/>
    <qualified-type-def type-id='type-id-331' restrict='yes' id='type-id-332'/>
    <qualified-type-def type-id='type-id-36' restrict='yes' id='type-id-333'/>
    <qualified-type-def type-id='type-id-325' const='yes' id='type-id-334'/>
    <pointer-type-def type-id='type-id-334' size-in-bits='64' id='type-id-335'/>
    <qualified-type-def type-id='type-id-335' restrict='yes' id='type-id-336'/>
    <qualified-type-def type-id='type-id-187' const='yes' id='type-id-337'/>
    <pointer-type-def type-id='type-id-337' size-in-bits='64' id='type-id-338'/>
    <qualified-type-def type-id='type-id-317' const='yes' id='type-id-339'/>
    <pointer-type-def type-id='type-id-339' size-in-bits='64' id='type-id-340'/>
    <pointer-type-def type-id='type-id-326' size-in-bits='64' id='type-id-341'/>
    <qualified-type-def type-id='type-id-341' restrict='yes' id='type-id-342'/>
    <pointer-type-def type-id='type-id-290' size-in-bits='64' id='type-id-343'/>
    <pointer-type-def type-id='type-id-315' size-in-bits='64' id='type-id-344'/>
    <pointer-type-def type-id='type-id-186' size-in-bits='64' id='type-id-289'/>
    <pointer-type-def type-id='type-id-82' size-in-bits='64' id='type-id-345'/>
    <pointer-type-def type-id='type-id-317' size-in-bits='64' id='type-id-346'/>
    <pointer-type-def type-id='type-id-121' size-in-bits='64' id='type-id-347'/>
    <pointer-type-def type-id='type-id-348' size-in-bits='64' id='type-id-349'/>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' id='type-id-350'/>
    <pointer-type-def type-id='type-id-351' size-in-bits='64' id='type-id-312'/>
    <pointer-type-def type-id='type-id-321' size-in-bits='64' id='type-id-310'/>
    <pointer-type-def type-id='type-id-352' size-in-bits='64' id='type-id-307'/>
    <pointer-type-def type-id='type-id-353' size-in-bits='64' id='type-id-313'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-351'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-352'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-353'/>
    <qualified-type-def type-id='type-id-39' restrict='yes' id='type-id-354'/>
    <function-decl name='__errno_location' filepath='/usr/include/errno.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-230'/>
    </function-decl>
    <function-decl name='pthread_create' filepath='/usr/include/pthread.h' line='202' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-342'/>
      <parameter type-id='type-id-336'/>
      <parameter type-id='type-id-349'/>
      <parameter type-id='type-id-354'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='pthread_join' filepath='/usr/include/pthread.h' line='219' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-326'/>
      <parameter type-id='type-id-350'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='pthread_detach' filepath='/usr/include/pthread.h' line='269' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-326'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='fclose' filepath='/usr/include/stdio.h' line='184' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-328'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='fopen' filepath='/usr/include/stdio.h' line='264' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-333'/>
      <parameter type-id='type-id-333'/>
      <return type-id='type-id-328'/>
    </function-decl>
    <function-decl name='malloc' filepath='/usr/include/stdlib.h' line='672' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='calloc' filepath='/usr/include/stdlib.h' line='675' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-82'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='free' filepath='/usr/include/stdlib.h' line='687' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='getenv' filepath='/usr/include/stdlib.h' line='773' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-36'/>
      <return type-id='type-id-65'/>
    </function-decl>
    <function-decl name='strcmp' filepath='/usr/include/string.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-36'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='nanosleep' filepath='/usr/include/time.h' line='282' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-340'/>
      <parameter type-id='type-id-346'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='clock_gettime' filepath='/usr/include/time.h' line='289' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-323'/>
      <parameter type-id='type-id-346'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='sysconf' filepath='/usr/include/unistd.h' line='640' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='syscall' filepath='/usr/include/unistd.h' line='1091' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-22'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='__fgets_chk' filepath='/usr/include/x86_64-linux-gnu/bits/stdio2-decl.h' line='106' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-330'/>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-329'/>
      <return type-id='type-id-65'/>
    </function-decl>
    <function-decl name='mmap' filepath='/usr/include/x86_64-linux-gnu/sys/mman.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-309'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='munmap' filepath='/usr/include/x86_64-linux-gnu/sys/mman.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-82'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='mprotect' filepath='/usr/include/x86_64-linux-gnu/sys/mman.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='madvise' filepath='/usr/include/x86_64-linux-gnu/sys/mman.h' line='94' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='mincore' filepath='/usr/include/x86_64-linux-gnu/sys/mman.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-347'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='runloom_coro_stack_size' mangled-name='runloom_coro_stack_size' filepath='src/runloom_c/coro.c' line='139' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_coro_stack_size'>
      <parameter type-id='type-id-338' name='c' filepath='src/runloom_c/coro.c' line='139' column='1'/>
      <return type-id='type-id-82'/>
    </function-decl>
    <function-decl name='runloom_coro_stack_base' mangled-name='runloom_coro_stack_base' filepath='src/runloom_c/coro.c' line='152' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_coro_stack_base'>
      <parameter type-id='type-id-338' name='c' filepath='src/runloom_c/coro.c' line='152' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='runloom_coro_guard_size' mangled-name='runloom_coro_guard_size' filepath='src/runloom_c/coro.c' line='165' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_coro_guard_size'>
      <return type-id='type-id-82'/>
    </function-decl>
    <function-decl name='runloom_coro_backend' mangled-name='runloom_coro_backend' filepath='src/runloom_c/coro.c' line='186' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_coro_backend'>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='runloom_coro_paint_set' mangled-name='runloom_coro_paint_set' filepath='src/runloom_c/coro.c' line='905' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_coro_paint_set'>
      <parameter type-id='type-id-21' name='enabled' filepath='src/runloom_c/coro.c' line='905' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='runloom_coro_paint_enabled' mangled-name='runloom_coro_paint_enabled' filepath='src/runloom_c/coro.c' line='906' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_coro_paint_enabled'>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='runloom_coro_scrub_set' mangled-name='runloom_coro_scrub_set' filepath='src/runloom_c/coro.c' line='918' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_coro_scrub_set'>
      <parameter type-id='type-id-21' name='enabled' filepath='src/runloom_c/coro.c' line='918' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='runloom_coro_scrub_enabled' mangled-name='runloom_coro_scrub_enabled' filepath='src/runloom_c/coro.c' line='919' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_coro_scrub_enabled'>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='runloom_coro_thread_init' mangled-name='runloom_coro_thread_init' filepath='src/runloom_c/coro.c' line='1033' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_coro_thread_init'>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='runloom_coro_thread_fini' mangled-name='runloom_coro_thread_fini' filepath='src/runloom_c/coro.c' line='1049' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_coro_thread_fini'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='runloom_coro_warmup' mangled-name='runloom_coro_warmup' filepath='src/runloom_c/coro.c' line='1061' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_coro_warmup'>
      <parameter type-id='type-id-82' name='stack_size' filepath='src/runloom_c/coro.c' line='1061' column='1'/>
      <parameter type-id='type-id-21' name='n' filepath='src/runloom_c/coro.c' line='1061' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='runloom_coro_prewarm' mangled-name='runloom_coro_prewarm' filepath='src/runloom_c/coro.c' line='1136' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_coro_prewarm'>
      <parameter type-id='type-id-82' name='stack_size' filepath='src/runloom_c/coro.c' line='1136' column='1'/>
      <parameter type-id='type-id-21' name='n' filepath='src/runloom_c/coro.c' line='1136' column='1'/>
      <parameter type-id='type-id-21' name='background' filepath='src/runloom_c/coro.c' line='1136' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='runloom_coro_prewarm_stop' mangled-name='runloom_coro_prewarm_stop' filepath='src/runloom_c/coro.c' line='1209' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_coro_prewarm_stop'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='runloom_coro_prewarm_keep' mangled-name='runloom_coro_prewarm_keep' filepath='src/runloom_c/coro.c' line='1223' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_coro_prewarm_keep'>
      <parameter type-id='type-id-82' name='stack_size' filepath='src/runloom_c/coro.c' line='1223' column='1'/>
      <parameter type-id='type-id-21' name='target' filepath='src/runloom_c/coro.c' line='1223' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='runloom_coro_prewarm_reset_after_fork' mangled-name='runloom_coro_prewarm_reset_after_fork' filepath='src/runloom_c/coro.c' line='1252' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_coro_prewarm_reset_after_fork'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='runloom_stack_autocap_init' mangled-name='runloom_stack_autocap_init' filepath='src/runloom_c/coro.c' line='1277' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_stack_autocap_init'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='runloom_stack_autocap_tick' mangled-name='runloom_stack_autocap_tick' filepath='src/runloom_c/coro.c' line='1329' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_stack_autocap_tick'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='runloom_stack_autocap_reset' mangled-name='runloom_stack_autocap_reset' filepath='src/runloom_c/coro.c' line='1368' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_stack_autocap_reset'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='runloom_coro_new' mangled-name='runloom_coro_new' filepath='src/runloom_c/coro.c' line='1505' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_coro_new'>
      <parameter type-id='type-id-82' name='stack_size' filepath='src/runloom_c/coro.c' line='1505' column='1'/>
      <parameter type-id='type-id-288' name='entry' filepath='src/runloom_c/coro.c' line='1506' column='1'/>
      <parameter type-id='type-id-39' name='user' filepath='src/runloom_c/coro.c' line='1507' column='1'/>
      <return type-id='type-id-130'/>
    </function-decl>
    <function-decl name='runloom_coro_init_at' mangled-name='runloom_coro_init_at' filepath='src/runloom_c/coro.c' line='1573' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_coro_init_at'>
      <parameter type-id='type-id-39' name='mem' filepath='src/runloom_c/coro.c' line='1573' column='1'/>
      <parameter type-id='type-id-82' name='stack_size' filepath='src/runloom_c/coro.c' line='1573' column='1'/>
      <parameter type-id='type-id-39' name='stack' filepath='src/runloom_c/coro.c' line='1573' column='1'/>
      <parameter type-id='type-id-288' name='entry' filepath='src/runloom_c/coro.c' line='1574' column='1'/>
      <parameter type-id='type-id-39' name='user' filepath='src/runloom_c/coro.c' line='1574' column='1'/>
      <return type-id='type-id-130'/>
    </function-decl>
    <function-decl name='runloom_coro_struct_size' mangled-name='runloom_coro_struct_size' filepath='src/runloom_c/coro.c' line='1597' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_coro_struct_size'>
      <return type-id='type-id-82'/>
    </function-decl>
    <function-decl name='runloom_mn_hub_count' filepath='src/runloom_c/coro.c' line='1640' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='runloom_coro_bulk_init' mangled-name='runloom_coro_bulk_init' filepath='src/runloom_c/coro.c' line='1670' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_coro_bulk_init'>
      <parameter type-id='type-id-39' name='coro_arena' filepath='src/runloom_c/coro.c' line='1670' column='1'/>
      <parameter type-id='type-id-82' name='coro_stride' filepath='src/runloom_c/coro.c' line='1670' column='1'/>
      <parameter type-id='type-id-39' name='g_arena' filepath='src/runloom_c/coro.c' line='1671' column='1'/>
      <parameter type-id='type-id-82' name='g_stride' filepath='src/runloom_c/coro.c' line='1671' column='1'/>
      <parameter type-id='type-id-82' name='g_coro_off' filepath='src/runloom_c/coro.c' line='1671' column='1'/>
      <parameter type-id='type-id-82' name='stack_size' filepath='src/runloom_c/coro.c' line='1672' column='1'/>
      <parameter type-id='type-id-22' name='n' filepath='src/runloom_c/coro.c' line='1672' column='1'/>
      <parameter type-id='type-id-288' name='entry' filepath='src/runloom_c/coro.c' line='1672' column='1'/>
      <parameter type-id='type-id-345' name='start_slot_out' filepath='src/runloom_c/coro.c' line='1673' column='1'/>
      <parameter type-id='type-id-230' name='node_out' filepath='src/runloom_c/coro.c' line='1673' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='runloom_coro_arena_release' mangled-name='runloom_coro_arena_release' filepath='src/runloom_c/coro.c' line='1768' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_coro_arena_release'>
      <parameter type-id='type-id-82' name='start_slot' filepath='src/runloom_c/coro.c' line='1768' column='1'/>
      <parameter type-id='type-id-22' name='n' filepath='src/runloom_c/coro.c' line='1768' column='1'/>
      <parameter type-id='type-id-82' name='stack_size' filepath='src/runloom_c/coro.c' line='1768' column='1'/>
      <parameter type-id='type-id-21' name='node' filepath='src/runloom_c/coro.c' line='1768' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='runloom_coro_arena_stack' mangled-name='runloom_coro_arena_stack' filepath='src/runloom_c/coro.c' line='1807' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_coro_arena_stack'>
      <parameter type-id='type-id-82' name='stack_size' filepath='src/runloom_c/coro.c' line='1807' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='runloom_coro_destroy' mangled-name='runloom_coro_destroy' filepath='src/runloom_c/coro.c' line='1815' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_coro_destroy'>
      <parameter type-id='type-id-130' name='c' filepath='src/runloom_c/coro.c' line='1815' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='runloom_coro_resume' mangled-name='runloom_coro_resume' filepath='src/runloom_c/coro.c' line='1952' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_coro_resume'>
      <parameter type-id='type-id-130' name='c' filepath='src/runloom_c/coro.c' line='1952' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='runloom_coro_done' mangled-name='runloom_coro_done' filepath='src/runloom_c/coro.c' line='1985' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_coro_done'>
      <parameter type-id='type-id-338' name='c' filepath='src/runloom_c/coro.c' line='1985' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='runloom_coro_madvise_idle' mangled-name='runloom_coro_madvise_idle' filepath='src/runloom_c/coro.c' line='2201' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_coro_madvise_idle'>
      <parameter type-id='type-id-130' name='c' filepath='src/runloom_c/coro.c' line='2201' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='runloom_coro_park_reclaim_set' mangled-name='runloom_coro_park_reclaim_set' filepath='src/runloom_c/coro.c' line='2235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_coro_park_reclaim_set'>
      <parameter type-id='type-id-21' name='on' filepath='src/runloom_c/coro.c' line='2235' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='runloom_coro_park' mangled-name='runloom_coro_park' filepath='src/runloom_c/coro.c' line='2240' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_coro_park'>
      <parameter type-id='type-id-130' name='c' filepath='src/runloom_c/coro.c' line='2240' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='runloom_coro_scan_hwm' mangled-name='runloom_coro_scan_hwm' filepath='src/runloom_c/coro.c' line='2263' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_coro_scan_hwm'>
      <parameter type-id='type-id-130' name='c' filepath='src/runloom_c/coro.c' line='2263' column='1'/>
      <return type-id='type-id-82'/>
    </function-decl>
    <function-decl name='runloom_coro_reset_after_fork' mangled-name='runloom_coro_reset_after_fork' filepath='src/runloom_c/coro.c' line='2279' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_coro_reset_after_fork'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='runloom_asm_swap' filepath='src/runloom_c/fcontext.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-344'/>
      <parameter type-id='type-id-344'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='runloom_asm_make_ctx' filepath='src/runloom_c/fcontext.h' line='65' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-343'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='runloom_crash_thread_arm' filepath='src/runloom_c/runloom_crash.h' line='65' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='runloom_crash_thread_disarm' filepath='src/runloom_c/runloom_crash.h' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='runloom_delay_inject' filepath='src/runloom_c/runloom_diag.h' line='164' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-327'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='runloom_invariant_fail' filepath='src/runloom_c/runloom_diag.h' line='175' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <type-decl name='variadic parameter type' id='type-id-355'/>
    <function-type size-in-bits='64' id='type-id-348'>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-39'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='src/runloom_c/fcontext.c' language='LANG_C11'>
    <function-decl name='runloom_asm_entry' mangled-name='runloom_asm_entry' filepath='src/runloom_c/fcontext.c' line='12' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_asm_entry'>
      <parameter type-id='type-id-343' name='c' filepath='src/runloom_c/fcontext.c' line='12' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/runloom_c/io_uring.c' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-356' size-in-bits='16' id='type-id-357'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-4' id='type-id-5'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-358' size-in-bits='64' id='type-id-359'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-4' id='type-id-5'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-358' size-in-bits='unknown' id='type-id-360'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='type-id-4' id='type-id-361'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-362' size-in-bits='unknown' id='type-id-363'>
      <subrange length='unknown' lower-bound='0' upper-bound='-1' type-id='type-id-4' id='type-id-364'/>
    </array-type-def>
    <class-decl name='io_uring_cqe' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/linux/io_uring.h' line='401' column='1' id='type-id-365'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='user_data' type-id='type-id-358' visibility='default' filepath='/usr/include/linux/io_uring.h' line='402' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='res' type-id='type-id-366' visibility='default' filepath='/usr/include/linux/io_uring.h' line='403' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='flags' type-id='type-id-367' visibility='default' filepath='/usr/include/linux/io_uring.h' line='404' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='big_cqe' type-id='type-id-360' visibility='default' filepath='/usr/include/linux/io_uring.h' line='410' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='io_uring_sqe' size-in-bits='512' is-struct='yes' visibility='default' filepath='/usr/include/linux/io_uring.h' line='30' column='1' id='type-id-368'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opcode' type-id='type-id-362' visibility='default' filepath='/usr/include/linux/io_uring.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='flags' type-id='type-id-362' visibility='default' filepath='/usr/include/linux/io_uring.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='ioprio' type-id='type-id-356' visibility='default' filepath='/usr/include/linux/io_uring.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fd' type-id='type-id-366' visibility='default' filepath='/usr/include/linux/io_uring.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='' type-id='type-id-369' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='' type-id='type-id-370' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='len' type-id='type-id-367' visibility='default' filepath='/usr/include/linux/io_uring.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='' type-id='type-id-371' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='user_data' type-id='type-id-358' visibility='default' filepath='/usr/include/linux/io_uring.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='' type-id='type-id-372' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='personality' type-id='type-id-356' visibility='default' filepath='/usr/include/linux/io_uring.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='' type-id='type-id-373' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='' type-id='type-id-374' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='ms_entry' size-in-bits='128' is-struct='yes' visibility='default' filepath='src/runloom_c/io_uring_l_do.c.inc' line='172' column='1' id='type-id-375'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bid' type-id='type-id-76' visibility='default' filepath='src/runloom_c/io_uring_l_do.c.inc' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='len' type-id='type-id-76' visibility='default' filepath='src/runloom_c/io_uring_l_do.c.inc' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='type-id-376' visibility='default' filepath='src/runloom_c/io_uring_l_do.c.inc' line='175' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='runloom_iouring_ms' size-in-bits='1280' is-struct='yes' visibility='default' filepath='src/runloom_c/io_uring_l_do.c.inc' line='178' column='1' id='type-id-377'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-378' visibility='default' filepath='src/runloom_c/io_uring_l_do.c.inc' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='fd' type-id='type-id-21' visibility='default' filepath='src/runloom_c/io_uring_l_do.c.inc' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='closing' type-id='type-id-21' visibility='default' filepath='src/runloom_c/io_uring_l_do.c.inc' line='181' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='err' type-id='type-id-21' visibility='default' filepath='src/runloom_c/io_uring_l_do.c.inc' line='182' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='eof' type-id='type-id-21' visibility='default' filepath='src/runloom_c/io_uring_l_do.c.inc' line='183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='armed' type-id='type-id-21' visibility='default' filepath='src/runloom_c/io_uring_l_do.c.inc' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='ready_head' type-id='type-id-379' visibility='default' filepath='src/runloom_c/io_uring_l_do.c.inc' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='ready_tail' type-id='type-id-379' visibility='default' filepath='src/runloom_c/io_uring_l_do.c.inc' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='inflight_bid' type-id='type-id-21' visibility='default' filepath='src/runloom_c/io_uring_l_do.c.inc' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='inflight_off' type-id='type-id-78' visibility='default' filepath='src/runloom_c/io_uring_l_do.c.inc' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='inflight_len' type-id='type-id-78' visibility='default' filepath='src/runloom_c/io_uring_l_do.c.inc' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='waiter_g' type-id='type-id-126' visibility='default' filepath='src/runloom_c/io_uring_l_do.c.inc' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='waiter_hub' type-id='type-id-39' visibility='default' filepath='src/runloom_c/io_uring_l_do.c.inc' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='refcount' type-id='type-id-21' visibility='default' filepath='src/runloom_c/io_uring_l_do.c.inc' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='lock' type-id='type-id-123' visibility='default' filepath='src/runloom_c/io_uring_l_do.c.inc' line='210' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='runloom_iouring_op' size-in-bits='320' is-struct='yes' visibility='default' filepath='src/runloom_c/io_uring_l_sys.c.inc' line='112' column='1' id='type-id-380'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-21' visibility='default' filepath='src/runloom_c/io_uring_l_sys.c.inc' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='g' type-id='type-id-126' visibility='default' filepath='src/runloom_c/io_uring_l_sys.c.inc' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hub' type-id='type-id-39' visibility='default' filepath='src/runloom_c/io_uring_l_sys.c.inc' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='result' type-id='type-id-381' visibility='default' filepath='src/runloom_c/io_uring_l_sys.c.inc' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='wait' type-id='type-id-21' visibility='default' filepath='src/runloom_c/io_uring_l_sys.c.inc' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ring' type-id='type-id-39' visibility='default' filepath='src/runloom_c/io_uring_l_sys.c.inc' line='118' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='runloom_iouring_ring' size-in-bits='1536' is-struct='yes' visibility='default' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='5' column='1' id='type-id-382'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ring_fd' type-id='type-id-21' visibility='default' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='6' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='eventfd_fd' type-id='type-id-21' visibility='default' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='7' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='defer_taskrun' type-id='type-id-21' visibility='default' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='8' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sq_mmap' type-id='type-id-39' visibility='default' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sq_mmap_size' type-id='type-id-82' visibility='default' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='sq_head' type-id='type-id-383' visibility='default' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='sq_tail' type-id='type-id-383' visibility='default' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='sq_mask' type-id='type-id-70' visibility='default' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='sq_entries' type-id='type-id-70' visibility='default' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='sq_array' type-id='type-id-383' visibility='default' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='sq_flags' type-id='type-id-383' visibility='default' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='sqes' type-id='type-id-384' visibility='default' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='sqe_mmap' type-id='type-id-39' visibility='default' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='sqe_mmap_size' type-id='type-id-82' visibility='default' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='cq_mmap' type-id='type-id-39' visibility='default' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='cq_mmap_size' type-id='type-id-82' visibility='default' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='cq_head' type-id='type-id-383' visibility='default' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='cq_tail' type-id='type-id-383' visibility='default' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='cq_mask' type-id='type-id-70' visibility='default' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='cq_entries' type-id='type-id-70' visibility='default' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='cqes' type-id='type-id-385' visibility='default' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='inflight' type-id='type-id-142' visibility='default' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='sq_submitted_tail' type-id='type-id-70' visibility='default' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='loop_wake_fd' type-id='type-id-21' visibility='default' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1248'>
        <var-decl name='loop_epoll_fd' type-id='type-id-21' visibility='default' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='ms_pool' type-id='type-id-39' visibility='default' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='ms_bring' type-id='type-id-39' visibility='default' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='ms_count' type-id='type-id-70' visibility='default' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1440'>
        <var-decl name='ms_size' type-id='type-id-70' visibility='default' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='ms_mask' type-id='type-id-70' visibility='default' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='51' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/linux/io_uring.h' line='90' column='1' id='type-id-386'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr_len' type-id='type-id-356' visibility='default' filepath='/usr/include/linux/io_uring.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='__pad3' type-id='type-id-357' visibility='default' filepath='/usr/include/linux/io_uring.h' line='92' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/linux/io_uring.h' line='38' column='1' id='type-id-387'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cmd_op' type-id='type-id-367' visibility='default' filepath='/usr/include/linux/io_uring.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__pad1' type-id='type-id-367' visibility='default' filepath='/usr/include/linux/io_uring.h' line='40' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/linux/io_uring.h' line='46' column='1' id='type-id-388'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='level' type-id='type-id-367' visibility='default' filepath='/usr/include/linux/io_uring.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='optname' type-id='type-id-367' visibility='default' filepath='/usr/include/linux/io_uring.h' line='48' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/linux/io_uring.h' line='96' column='1' id='type-id-389'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr3' type-id='type-id-358' visibility='default' filepath='/usr/include/linux/io_uring.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__pad2' type-id='type-id-359' visibility='default' filepath='/usr/include/linux/io_uring.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__int32_t' type-id='type-id-21' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='41' column='1' id='type-id-390'/>
    <typedef-decl name='__int64_t' type-id='type-id-22' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='44' column='1' id='type-id-391'/>
    <typedef-decl name='__s32' type-id='type-id-21' filepath='/usr/include/asm-generic/int-ll64.h' line='26' column='1' id='type-id-366'/>
    <typedef-decl name='__u16' type-id='type-id-160' filepath='/usr/include/asm-generic/int-ll64.h' line='24' column='1' id='type-id-356'/>
    <typedef-decl name='__u32' type-id='type-id-70' filepath='/usr/include/asm-generic/int-ll64.h' line='27' column='1' id='type-id-367'/>
    <typedef-decl name='__u64' type-id='type-id-201' filepath='/usr/include/asm-generic/int-ll64.h' line='31' column='1' id='type-id-358'/>
    <typedef-decl name='__u8' type-id='type-id-121' filepath='/usr/include/asm-generic/int-ll64.h' line='21' column='1' id='type-id-362'/>
    <typedef-decl name='int32_t' type-id='type-id-390' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='26' column='1' id='type-id-381'/>
    <typedef-decl name='int64_t' type-id='type-id-391' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='27' column='1' id='type-id-242'/>
    <typedef-decl name='ms_entry_t' type-id='type-id-375' filepath='src/runloom_c/io_uring_l_do.c.inc' line='176' column='1' id='type-id-392'/>
    <typedef-decl name='runloom_iouring_ms_t' type-id='type-id-377' filepath='src/runloom_c/io_uring.h' line='113' column='1' id='type-id-393'/>
    <typedef-decl name='runloom_iouring_off_t' type-id='type-id-242' filepath='src/runloom_c/io_uring.h' line='33' column='1' id='type-id-394'/>
    <typedef-decl name='runloom_iouring_op_t' type-id='type-id-380' filepath='src/runloom_c/io_uring_l_sys.c.inc' line='122' column='1' id='type-id-378'/>
    <typedef-decl name='runloom_iouring_ring_t' type-id='type-id-382' filepath='src/runloom_c/io_uring.h' line='157' column='1' id='type-id-395'/>
    <typedef-decl name='runloom_iouring_ssize_t' type-id='type-id-242' filepath='src/runloom_c/io_uring.h' line='32' column='1' id='type-id-396'/>
    <union-decl name='__anonymous_union__4' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='/usr/include/linux/io_uring.h' line='86' column='1' id='type-id-373'>
      <data-member access='public'>
        <var-decl name='splice_fd_in' type-id='type-id-366' visibility='default' filepath='/usr/include/linux/io_uring.h' line='87' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='file_index' type-id='type-id-367' visibility='default' filepath='/usr/include/linux/io_uring.h' line='88' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='optlen' type-id='type-id-367' visibility='default' filepath='/usr/include/linux/io_uring.h' line='89' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='' type-id='type-id-386' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__3' size-in-bits='16' is-anonymous='yes' visibility='default' filepath='/usr/include/linux/io_uring.h' line='78' column='1' id='type-id-372'>
      <data-member access='public'>
        <var-decl name='buf_index' type-id='type-id-356' visibility='default' filepath='/usr/include/linux/io_uring.h' line='80' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='buf_group' type-id='type-id-356' visibility='default' filepath='/usr/include/linux/io_uring.h' line='82' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__2' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='/usr/include/linux/io_uring.h' line='52' column='1' id='type-id-371'>
      <data-member access='public'>
        <var-decl name='rw_flags' type-id='type-id-367' visibility='default' filepath='/usr/include/linux/io_uring.h' line='53' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='fsync_flags' type-id='type-id-367' visibility='default' filepath='/usr/include/linux/io_uring.h' line='54' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='poll_events' type-id='type-id-356' visibility='default' filepath='/usr/include/linux/io_uring.h' line='55' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='poll32_events' type-id='type-id-367' visibility='default' filepath='/usr/include/linux/io_uring.h' line='56' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sync_range_flags' type-id='type-id-367' visibility='default' filepath='/usr/include/linux/io_uring.h' line='57' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='msg_flags' type-id='type-id-367' visibility='default' filepath='/usr/include/linux/io_uring.h' line='58' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='timeout_flags' type-id='type-id-367' visibility='default' filepath='/usr/include/linux/io_uring.h' line='59' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='accept_flags' type-id='type-id-367' visibility='default' filepath='/usr/include/linux/io_uring.h' line='60' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='cancel_flags' type-id='type-id-367' visibility='default' filepath='/usr/include/linux/io_uring.h' line='61' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='open_flags' type-id='type-id-367' visibility='default' filepath='/usr/include/linux/io_uring.h' line='62' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='statx_flags' type-id='type-id-367' visibility='default' filepath='/usr/include/linux/io_uring.h' line='63' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='fadvise_advice' type-id='type-id-367' visibility='default' filepath='/usr/include/linux/io_uring.h' line='64' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='splice_flags' type-id='type-id-367' visibility='default' filepath='/usr/include/linux/io_uring.h' line='65' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='rename_flags' type-id='type-id-367' visibility='default' filepath='/usr/include/linux/io_uring.h' line='66' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='unlink_flags' type-id='type-id-367' visibility='default' filepath='/usr/include/linux/io_uring.h' line='67' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='hardlink_flags' type-id='type-id-367' visibility='default' filepath='/usr/include/linux/io_uring.h' line='68' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='xattr_flags' type-id='type-id-367' visibility='default' filepath='/usr/include/linux/io_uring.h' line='69' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='msg_ring_flags' type-id='type-id-367' visibility='default' filepath='/usr/include/linux/io_uring.h' line='70' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='uring_cmd_flags' type-id='type-id-367' visibility='default' filepath='/usr/include/linux/io_uring.h' line='71' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='waitid_flags' type-id='type-id-367' visibility='default' filepath='/usr/include/linux/io_uring.h' line='72' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='futex_flags' type-id='type-id-367' visibility='default' filepath='/usr/include/linux/io_uring.h' line='73' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='install_fd_flags' type-id='type-id-367' visibility='default' filepath='/usr/include/linux/io_uring.h' line='74' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__1' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/linux/io_uring.h' line='43' column='1' id='type-id-370'>
      <data-member access='public'>
        <var-decl name='addr' type-id='type-id-358' visibility='default' filepath='/usr/include/linux/io_uring.h' line='44' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='splice_off_in' type-id='type-id-358' visibility='default' filepath='/usr/include/linux/io_uring.h' line='45' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='' type-id='type-id-388' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/linux/io_uring.h' line='35' column='1' id='type-id-369'>
      <data-member access='public'>
        <var-decl name='off' type-id='type-id-358' visibility='default' filepath='/usr/include/linux/io_uring.h' line='36' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='addr2' type-id='type-id-358' visibility='default' filepath='/usr/include/linux/io_uring.h' line='37' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='' type-id='type-id-387' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__5' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='/usr/include/linux/io_uring.h' line='95' column='1' id='type-id-374'>
      <data-member access='public'>
        <var-decl name='' type-id='type-id-389' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='optval' type-id='type-id-358' visibility='default' filepath='/usr/include/linux/io_uring.h' line='100' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='cmd' type-id='type-id-363' visibility='default' filepath='/usr/include/linux/io_uring.h' line='105' column='1'/>
      </data-member>
    </union-decl>
    <qualified-type-def type-id='type-id-395' const='yes' id='type-id-397'/>
    <pointer-type-def type-id='type-id-397' size-in-bits='64' id='type-id-398'/>
    <pointer-type-def type-id='type-id-365' size-in-bits='64' id='type-id-385'/>
    <pointer-type-def type-id='type-id-368' size-in-bits='64' id='type-id-384'/>
    <pointer-type-def type-id='type-id-375' size-in-bits='64' id='type-id-376'/>
    <pointer-type-def type-id='type-id-392' size-in-bits='64' id='type-id-379'/>
    <pointer-type-def type-id='type-id-393' size-in-bits='64' id='type-id-399'/>
    <pointer-type-def type-id='type-id-382' size-in-bits='64' id='type-id-400'/>
    <pointer-type-def type-id='type-id-395' size-in-bits='64' id='type-id-401'/>
    <pointer-type-def type-id='type-id-70' size-in-bits='64' id='type-id-383'/>
    <function-decl name='PyEval_SaveThread' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/ceval.h' line='111' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='PyEval_RestoreThread' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/ceval.h' line='112' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='posix_memalign' filepath='/usr/include/stdlib.h' line='718' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-350'/>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-82'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='close' filepath='/usr/include/unistd.h' line='358' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='write' filepath='/usr/include/unistd.h' line='378' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-82'/>
      <return type-id='type-id-156'/>
    </function-decl>
    <function-decl name='__read_chk' filepath='/usr/include/x86_64-linux-gnu/bits/unistd-decl.h' line='26' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-82'/>
      <return type-id='type-id-156'/>
    </function-decl>
    <function-decl name='eventfd' filepath='/usr/include/x86_64-linux-gnu/sys/eventfd.h' line='34' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-70'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='runloom_iouring_available' mangled-name='runloom_iouring_available' filepath='src/runloom_c/io_uring_l_buf.c.inc' line='5' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_iouring_available'>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='runloom_iouring_eventfd' mangled-name='runloom_iouring_eventfd' filepath='src/runloom_c/io_uring_l_buf.c.inc' line='31' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_iouring_eventfd'>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='runloom_iouring_inflight' mangled-name='runloom_iouring_inflight' filepath='src/runloom_c/io_uring_l_buf.c.inc' line='37' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_iouring_inflight'>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='runloom_iouring_pbuf_available' mangled-name='runloom_iouring_pbuf_available' filepath='src/runloom_c/io_uring_l_buf.c.inc' line='42' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_iouring_pbuf_available'>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='runloom_iouring_pbuf_size' mangled-name='runloom_iouring_pbuf_size' filepath='src/runloom_c/io_uring_l_buf.c.inc' line='48' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_iouring_pbuf_size'>
      <return type-id='type-id-70'/>
    </function-decl>
    <function-decl name='runloom_iouring_pbuf_count' mangled-name='runloom_iouring_pbuf_count' filepath='src/runloom_c/io_uring_l_buf.c.inc' line='53' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_iouring_pbuf_count'>
      <return type-id='type-id-70'/>
    </function-decl>
    <function-decl name='runloom_iouring_pbuf_addr' mangled-name='runloom_iouring_pbuf_addr' filepath='src/runloom_c/io_uring_l_buf.c.inc' line='58' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_iouring_pbuf_addr'>
      <parameter type-id='type-id-70' name='bid' filepath='src/runloom_c/io_uring_l_buf.c.inc' line='58' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='runloom_iouring_pbuf_return' mangled-name='runloom_iouring_pbuf_return' filepath='src/runloom_c/io_uring_l_buf.c.inc' line='66' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_iouring_pbuf_return'>
      <parameter type-id='type-id-70' name='bid' filepath='src/runloom_c/io_uring_l_buf.c.inc' line='66' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='runloom_iouring_drain' mangled-name='runloom_iouring_drain' filepath='src/runloom_c/io_uring_l_buf.c.inc' line='140' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_iouring_drain'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='runloom_iouring_pread' mangled-name='runloom_iouring_pread' filepath='src/runloom_c/io_uring_l_do.c.inc' line='136' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_iouring_pread'>
      <parameter type-id='type-id-21' name='fd' filepath='src/runloom_c/io_uring_l_do.c.inc' line='136' column='1'/>
      <parameter type-id='type-id-39' name='buf' filepath='src/runloom_c/io_uring_l_do.c.inc' line='136' column='1'/>
      <parameter type-id='type-id-82' name='n' filepath='src/runloom_c/io_uring_l_do.c.inc' line='136' column='1'/>
      <parameter type-id='type-id-394' name='offset' filepath='src/runloom_c/io_uring_l_do.c.inc' line='137' column='1'/>
      <return type-id='type-id-396'/>
    </function-decl>
    <function-decl name='runloom_iouring_pwrite' mangled-name='runloom_iouring_pwrite' filepath='src/runloom_c/io_uring_l_do.c.inc' line='149' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_iouring_pwrite'>
      <parameter type-id='type-id-21' name='fd' filepath='src/runloom_c/io_uring_l_do.c.inc' line='149' column='1'/>
      <parameter type-id='type-id-39' name='buf' filepath='src/runloom_c/io_uring_l_do.c.inc' line='149' column='1'/>
      <parameter type-id='type-id-82' name='n' filepath='src/runloom_c/io_uring_l_do.c.inc' line='149' column='1'/>
      <parameter type-id='type-id-394' name='offset' filepath='src/runloom_c/io_uring_l_do.c.inc' line='150' column='1'/>
      <return type-id='type-id-396'/>
    </function-decl>
    <function-decl name='runloom_iouring_ms_open' mangled-name='runloom_iouring_ms_open' filepath='src/runloom_c/io_uring_l_do.c.inc' line='254' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_iouring_ms_open'>
      <parameter type-id='type-id-21' name='fd' filepath='src/runloom_c/io_uring_l_do.c.inc' line='254' column='1'/>
      <return type-id='type-id-399'/>
    </function-decl>
    <function-decl name='runloom_iouring_ms_recv' mangled-name='runloom_iouring_ms_recv' filepath='src/runloom_c/io_uring_l_do.c.inc' line='363' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_iouring_ms_recv'>
      <parameter type-id='type-id-399' name='h' filepath='src/runloom_c/io_uring_l_do.c.inc' line='363' column='1'/>
      <parameter type-id='type-id-39' name='buf' filepath='src/runloom_c/io_uring_l_do.c.inc' line='364' column='1'/>
      <parameter type-id='type-id-82' name='n' filepath='src/runloom_c/io_uring_l_do.c.inc' line='364' column='1'/>
      <return type-id='type-id-396'/>
    </function-decl>
    <function-decl name='runloom_iouring_loop_enabled' mangled-name='runloom_iouring_loop_enabled' filepath='src/runloom_c/io_uring_l_loop.c.inc' line='48' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_iouring_loop_enabled'>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='runloom_iouring_loop_ms_enabled' mangled-name='runloom_iouring_loop_ms_enabled' filepath='src/runloom_c/io_uring_l_loop.c.inc' line='89' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_iouring_loop_ms_enabled'>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='runloom_iouring_any_enabled' mangled-name='runloom_iouring_any_enabled' filepath='src/runloom_c/io_uring_l_loop.c.inc' line='107' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_iouring_any_enabled'>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='runloom_iouring_loop_hub_arm' mangled-name='runloom_iouring_loop_hub_arm' filepath='src/runloom_c/io_uring_l_loop.c.inc' line='346' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_iouring_loop_hub_arm'>
      <parameter type-id='type-id-401' name='r' filepath='src/runloom_c/io_uring_l_loop.c.inc' line='346' column='1'/>
      <parameter type-id='type-id-21' name='epoll_fd' filepath='src/runloom_c/io_uring_l_loop.c.inc' line='346' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='runloom_iouring_loop_wait' mangled-name='runloom_iouring_loop_wait' filepath='src/runloom_c/io_uring_l_loop.c.inc' line='379' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_iouring_loop_wait'>
      <parameter type-id='type-id-401' name='r' filepath='src/runloom_c/io_uring_l_loop.c.inc' line='379' column='1'/>
      <parameter type-id='type-id-23' name='timeout_ns' filepath='src/runloom_c/io_uring_l_loop.c.inc' line='379' column='1'/>
      <parameter type-id='type-id-230' name='flags_out' filepath='src/runloom_c/io_uring_l_loop.c.inc' line='380' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='runloom_iouring_loop_recv' mangled-name='runloom_iouring_loop_recv' filepath='src/runloom_c/io_uring_l_loop.c.inc' line='488' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_iouring_loop_recv'>
      <parameter type-id='type-id-401' name='r' filepath='src/runloom_c/io_uring_l_loop.c.inc' line='488' column='1'/>
      <parameter type-id='type-id-21' name='fd' filepath='src/runloom_c/io_uring_l_loop.c.inc' line='489' column='1'/>
      <parameter type-id='type-id-39' name='buf' filepath='src/runloom_c/io_uring_l_loop.c.inc' line='489' column='1'/>
      <parameter type-id='type-id-82' name='n' filepath='src/runloom_c/io_uring_l_loop.c.inc' line='489' column='1'/>
      <parameter type-id='type-id-21' name='flags' filepath='src/runloom_c/io_uring_l_loop.c.inc' line='490' column='1'/>
      <return type-id='type-id-396'/>
    </function-decl>
    <function-decl name='runloom_iouring_loop_send' mangled-name='runloom_iouring_loop_send' filepath='src/runloom_c/io_uring_l_loop.c.inc' line='502' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_iouring_loop_send'>
      <parameter type-id='type-id-401' name='r' filepath='src/runloom_c/io_uring_l_loop.c.inc' line='502' column='1'/>
      <parameter type-id='type-id-21' name='fd' filepath='src/runloom_c/io_uring_l_loop.c.inc' line='503' column='1'/>
      <parameter type-id='type-id-39' name='buf' filepath='src/runloom_c/io_uring_l_loop.c.inc' line='503' column='1'/>
      <parameter type-id='type-id-82' name='n' filepath='src/runloom_c/io_uring_l_loop.c.inc' line='504' column='1'/>
      <parameter type-id='type-id-21' name='flags' filepath='src/runloom_c/io_uring_l_loop.c.inc' line='504' column='1'/>
      <return type-id='type-id-396'/>
    </function-decl>
    <function-decl name='runloom_iouring_loop_wake' mangled-name='runloom_iouring_loop_wake' filepath='src/runloom_c/io_uring_l_loop.c.inc' line='518' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_iouring_loop_wake'>
      <parameter type-id='type-id-21' name='wake_fd' filepath='src/runloom_c/io_uring_l_loop.c.inc' line='518' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='runloom_iouring_loop_hub_disarm' mangled-name='runloom_iouring_loop_hub_disarm' filepath='src/runloom_c/io_uring_l_loop.c.inc' line='528' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_iouring_loop_hub_disarm'>
      <parameter type-id='type-id-401' name='r' filepath='src/runloom_c/io_uring_l_loop.c.inc' line='528' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='runloom_iouring_loop_ms_open' mangled-name='runloom_iouring_loop_ms_open' filepath='src/runloom_c/io_uring_l_loop.c.inc' line='638' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_iouring_loop_ms_open'>
      <parameter type-id='type-id-401' name='r' filepath='src/runloom_c/io_uring_l_loop.c.inc' line='638' column='1'/>
      <parameter type-id='type-id-21' name='fd' filepath='src/runloom_c/io_uring_l_loop.c.inc' line='638' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='runloom_iouring_loop_ms_recv' mangled-name='runloom_iouring_loop_ms_recv' filepath='src/runloom_c/io_uring_l_loop.c.inc' line='664' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_iouring_loop_ms_recv'>
      <parameter type-id='type-id-39' name='handle' filepath='src/runloom_c/io_uring_l_loop.c.inc' line='664' column='1'/>
      <parameter type-id='type-id-39' name='buf' filepath='src/runloom_c/io_uring_l_loop.c.inc' line='665' column='1'/>
      <parameter type-id='type-id-82' name='n' filepath='src/runloom_c/io_uring_l_loop.c.inc' line='665' column='1'/>
      <return type-id='type-id-396'/>
    </function-decl>
    <function-decl name='runloom_iouring_loop_ms_close' mangled-name='runloom_iouring_loop_ms_close' filepath='src/runloom_c/io_uring_l_loop.c.inc' line='717' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_iouring_loop_ms_close'>
      <parameter type-id='type-id-39' name='handle' filepath='src/runloom_c/io_uring_l_loop.c.inc' line='717' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='runloom_iouring_ms_close' mangled-name='runloom_iouring_ms_close' filepath='src/runloom_c/io_uring_l_msclose.c.inc' line='5' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_iouring_ms_close'>
      <parameter type-id='type-id-399' name='h' filepath='src/runloom_c/io_uring_l_msclose.c.inc' line='5' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='runloom_iouring_recv' mangled-name='runloom_iouring_recv' filepath='src/runloom_c/io_uring_l_msclose.c.inc' line='52' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_iouring_recv'>
      <parameter type-id='type-id-21' name='fd' filepath='src/runloom_c/io_uring_l_msclose.c.inc' line='52' column='1'/>
      <parameter type-id='type-id-39' name='buf' filepath='src/runloom_c/io_uring_l_msclose.c.inc' line='52' column='1'/>
      <parameter type-id='type-id-82' name='n' filepath='src/runloom_c/io_uring_l_msclose.c.inc' line='52' column='1'/>
      <parameter type-id='type-id-21' name='flags' filepath='src/runloom_c/io_uring_l_msclose.c.inc' line='52' column='1'/>
      <return type-id='type-id-396'/>
    </function-decl>
    <function-decl name='runloom_iouring_send' mangled-name='runloom_iouring_send' filepath='src/runloom_c/io_uring_l_msclose.c.inc' line='73' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_iouring_send'>
      <parameter type-id='type-id-21' name='fd' filepath='src/runloom_c/io_uring_l_msclose.c.inc' line='73' column='1'/>
      <parameter type-id='type-id-39' name='buf' filepath='src/runloom_c/io_uring_l_msclose.c.inc' line='73' column='1'/>
      <parameter type-id='type-id-82' name='n' filepath='src/runloom_c/io_uring_l_msclose.c.inc' line='73' column='1'/>
      <parameter type-id='type-id-21' name='flags' filepath='src/runloom_c/io_uring_l_msclose.c.inc' line='73' column='1'/>
      <return type-id='type-id-396'/>
    </function-decl>
    <function-decl name='runloom_iouring_ring_create' mangled-name='runloom_iouring_ring_create' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='58' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_iouring_ring_create'>
      <parameter type-id='type-id-21' name='defer_taskrun' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='58' column='1'/>
      <return type-id='type-id-401'/>
    </function-decl>
    <function-decl name='runloom_iouring_ring_destroy' mangled-name='runloom_iouring_ring_destroy' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='153' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_iouring_ring_destroy'>
      <parameter type-id='type-id-401' name='r' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='153' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='runloom_iouring_ring_eventfd' mangled-name='runloom_iouring_ring_eventfd' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='164' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_iouring_ring_eventfd'>
      <parameter type-id='type-id-398' name='r' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='164' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='runloom_iouring_ring_inflight' mangled-name='runloom_iouring_ring_inflight' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='169' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_iouring_ring_inflight'>
      <parameter type-id='type-id-398' name='r' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='169' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='runloom_iouring_ring_drain' mangled-name='runloom_iouring_ring_drain' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='208' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_iouring_ring_drain'>
      <parameter type-id='type-id-401' name='r' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='208' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='runloom_iouring_ring_get_events' mangled-name='runloom_iouring_ring_get_events' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='279' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_iouring_ring_get_events'>
      <parameter type-id='type-id-401' name='r' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='279' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='runloom_iouring_ring_recv' mangled-name='runloom_iouring_ring_recv' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='355' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_iouring_ring_recv'>
      <parameter type-id='type-id-401' name='r' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='355' column='1'/>
      <parameter type-id='type-id-21' name='fd' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='356' column='1'/>
      <parameter type-id='type-id-39' name='buf' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='356' column='1'/>
      <parameter type-id='type-id-82' name='n' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='356' column='1'/>
      <parameter type-id='type-id-21' name='flags' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='357' column='1'/>
      <return type-id='type-id-396'/>
    </function-decl>
    <function-decl name='runloom_iouring_ring_send' mangled-name='runloom_iouring_ring_send' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='369' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_iouring_ring_send'>
      <parameter type-id='type-id-401' name='r' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='369' column='1'/>
      <parameter type-id='type-id-21' name='fd' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='370' column='1'/>
      <parameter type-id='type-id-39' name='buf' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='370' column='1'/>
      <parameter type-id='type-id-82' name='n' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='371' column='1'/>
      <parameter type-id='type-id-21' name='flags' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='371' column='1'/>
      <return type-id='type-id-396'/>
    </function-decl>
    <function-decl name='runloom_iouring_cancel_g' mangled-name='runloom_iouring_cancel_g' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='394' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_iouring_cancel_g'>
      <parameter type-id='type-id-126' name='g' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='394' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='runloom_iouring_submit_cancel_for_op' mangled-name='runloom_iouring_submit_cancel_for_op' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='430' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='runloom_iouring_submit_cancel_for_op'>
      <parameter type-id='type-id-39' name='opv' filepath='src/runloom_c/io_uring_l_ring.c.inc' line='430' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='runloom_mn_hub_request_iouring_cancel' filepath='src/runloom_c/mn_sched.h' line='179' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='runloom_mn_current_iouring_ring' filepath='src/runloom_c/mn_sched.h' line='237' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-400'/>
    </function-decl>
    <function-decl name='runloom_netpoll_add_iouring_eventfd' filepath='src/runloom_c/netpoll.h' line='224' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='runloom_iouwake_trace_event' filepath='src/runloom_c/runloom_diag.h' line='223' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='runloom_sched_park_safe' filepath='src/runloom_c/runloom_sched.h' line='461' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='runloom_sched_wake_safe' filepath='src/runloom_c/runloom_sched.h' line='465' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-126'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/runloom_c/mn_sched.c' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-402' size-in-bits='64' id='type-id-403'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-4' id='type-id-5'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-404' size-in-bits='1024' id='type-id-405'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='type-id-4' id='type-id-406'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-8' size-in-bits='1536' id='type-id-407'>
      <subrange length='192' lower-bound='0' upper-bound='191' type-id='type-id-4' id='type-id-408'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-8' size-in-bits='384' id='type-id-409'>
      <subrange length='48' lower-bound='0' upper-bound='47' type-id='type-id-4' id='type-id-410'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='2048' id='type-id-411'>
      <subrange length='64' lower-bound='0' upper-bound='63' type-id='type-id-4' id='type-id-412'/>
    </array-type-def>
    <class-decl name='PyCodeObject' size-in-bits='1792' is-struct='yes' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='141' column='1' id='type-id-413'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-60' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='co_consts' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='co_names' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='co_exceptiontable' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='co_flags' type-id='type-id-21' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='co_argcount' type-id='type-id-21' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='co_posonlyargcount' type-id='type-id-21' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='co_kwonlyargcount' type-id='type-id-21' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='co_stacksize' type-id='type-id-21' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='co_firstlineno' type-id='type-id-21' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='co_nlocalsplus' type-id='type-id-21' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='co_framesize' type-id='type-id-21' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='co_nlocals' type-id='type-id-21' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='co_ncellvars' type-id='type-id-21' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='co_nfreevars' type-id='type-id-21' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='co_version' type-id='type-id-78' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='co_localsplusnames' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='co_localspluskinds' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='co_filename' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='co_name' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='co_qualname' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='co_linetable' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='co_weakreflist' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='co_executors' type-id='type-id-414' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_co_cached' type-id='type-id-415' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='_co_instrumentation_version' type-id='type-id-75' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_co_monitoring' type-id='type-id-416' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='_co_firsttraceable' type-id='type-id-21' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='co_extra' type-id='type-id-39' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='co_code_adaptive' type-id='type-id-299' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='141' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_PyCoCached' size-in-bits='256' is-struct='yes' naming-typedef-id='type-id-417' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='28' column='1' id='type-id-418'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_co_code' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_co_varnames' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_co_cellvars' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_co_freevars' type-id='type-id-2' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='32' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_PyCoLineInstrumentationData' size-in-bits='16' is-struct='yes' naming-typedef-id='type-id-419' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='39' column='1' id='type-id-420'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bytes_per_entry' type-id='type-id-50' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='data' type-id='type-id-421' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='41' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_PyCoMonitoringData' size-in-bits='512' is-struct='yes' naming-typedef-id='type-id-422' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='54' column='1' id='type-id-423'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='local_monitors' type-id='type-id-424' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='active_monitors' type-id='type-id-424' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tools' type-id='type-id-425' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='lines' type-id='type-id-426' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='line_tools' type-id='type-id-425' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='per_instruction_opcodes' type-id='type-id-425' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='per_instruction_tools' type-id='type-id-425' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='69' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_PyExecutorArray' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-427' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='45' column='1' id='type-id-428'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='type-id-21' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='capacity' type-id='type-id-21' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='executors' type-id='type-id-403' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='48' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_Py_LocalMonitors' size-in-bits='80' is-struct='yes' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='19' column='1' id='type-id-429'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tools' type-id='type-id-430' visibility='default' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='20' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_cond_s' size-in-bits='384' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='94' column='1' id='type-id-431'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__wseq' type-id='type-id-432' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__g1_start' type-id='type-id-432' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__g_refs' type-id='type-id-433' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__g_size' type-id='type-id-433' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='__g1_orig_size' type-id='type-id-70' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__wrefs' type-id='type-id-70' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='__g_signals' type-id='type-id-433' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='102' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='cpu_set_t' size-in-bits='1024' is-struct='yes' naming-typedef-id='type-id-434' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/cpu-set.h' line='39' column='1' id='type-id-435'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__bits' type-id='type-id-405' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/cpu-set.h' line='41' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='runloom_fibern_batch' size-in-bits='448' is-struct='yes' visibility='default' filepath='src/runloom_c/mn_sched_init_fini.c.inc' line='705' column='1' id='type-id-232'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='garena' type-id='type-id-39' visibility='default' filepath='src/runloom_c/mn_sched_init_fini.c.inc' line='706' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='carena' type-id='type-id-39' visibility='default' filepath='src/runloom_c/mn_sched_init_fini.c.inc' line='707' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='start_slot' type-id='type-id-82' visibility='default' filepath='src/runloom_c/mn_sched_init_fini.c.inc' line='708' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nslots' type-id='type-id-22' visibility='default' filepath='src/runloom_c/mn_sched_init_fini.c.inc' line='709' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='stack_size' type-id='type-id-82' visibility='default' filepath='src/runloom_c/mn_sched_init_fini.c.inc' line='710' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='node' type-id='type-id-21' visibility='default' filepath='src/runloom_c/mn_sched_init_fini.c.inc' line='711' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='live' type-id='type-id-22' visibility='default' filepath='src/runloom_c/mn_sched_init_fini.c.inc' line='712' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='runloom_hub_info' size-in-bits='1984' is-struct='yes' visibility='default' filepath='src/runloom_c/mn_sched.h' line='140' column='1' id='type-id-436'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='type-id-21' visibility='default' filepath='src/runloom_c/mn_sched.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='running_g' type-id='type-id-23' visibility='default' filepath='src/runloom_c/mn_sched.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='has_running_g' type-id='type-id-21' visibility='default' filepath='src/runloom_c/mn_sched.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dwell_ms' type-id='type-id-13' visibility='default' filepath='src/runloom_c/mn_sched.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='attach_state' type-id='type-id-21' visibility='default' filepath='src/runloom_c/mn_sched.h' line='145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pending' type-id='type-id-22' visibility='default' filepath='src/runloom_c/mn_sched.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='preempt_requested' type-id='type-id-21' visibility='default' filepath='src/runloom_c/mn_sched.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='instrumented' type-id='type-id-21' visibility='default' filepath='src/runloom_c/mn_sched.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='blocked_at' type-id='type-id-407' visibility='default' filepath='src/runloom_c/mn_sched.h' line='149' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h' line='28' column='1' id='type-id-437'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__low' type-id='type-id-70' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__high' type-id='type-id-70' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h' line='31' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PyCodeObject' type-id='type-id-413' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/pytypedefs.h' line='21' column='1' id='type-id-438'/>
    <typedef-decl name='_PyCoCached' type-id='type-id-418' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='33' column='1' id='type-id-417'/>
    <typedef-decl name='_PyCoLineInstrumentationData' type-id='type-id-420' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='42' column='1' id='type-id-419'/>
    <typedef-decl name='_PyCoMonitoringData' type-id='type-id-423' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='70' column='1' id='type-id-422'/>
    <typedef-decl name='_PyExecutorArray' type-id='type-id-428' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='49' column='1' id='type-id-427'/>
    <typedef-decl name='_PyFrameEvalFunction' type-id='type-id-439' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/pystate.h' line='273' column='1' id='type-id-251'/>
    <typedef-decl name='_Py_LocalMonitors' type-id='type-id-429' filepath='/home/x/.pyenv/versions/3.13.13t/include/python3.13t/cpython/code.h' line='21' column='1' id='type-id-424'/>
    <typedef-decl name='__atomic_wide_counter' type-id='type-id-440' filepath='/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h' line='33' column='1' id='type-id-432'/>
    <typedef-decl name='__cpu_mask' type-id='type-id-4' filepath='/usr/include/x86_64-linux-gnu/bits/cpu-set.h' line='32' column='1' id='type-id-404'/>
    <typedef-decl name='cpu_set_t' type-id='type-id-435' filepath='/usr/include/x86_64-linux-gnu/bits/cpu-set.h' line='42' column='1' id='type-id-434'/>
    <typedef-decl name='pthread_cond_t' type-id='type-id-441' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='80' column='1' id='type-id-442'/>
    <typedef-decl name='pthread_condattr_t' type-id='type-id-443' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='45' column='1' id='type-id-444'/>
    <typedef-decl name='runloom_hub_info_t' type-id='type-id-436' filepath='src/runloom_c/mn_sched.h' line='150' column='1' id='type-id-445'/>
    <typedef-decl name='runloom_iframe_cb' type-id='type-id-446' filepath='src/runloom_c/runloom_iframe.h' line='27' column='1' id='type-id-447'/>
    <array-type-def dimensions='1' type-id='type-id-50' size-in-bits='80' id='type-id-430'>
      <subrange length='10' lower-bound='0' upper-bound='9' type-id='type-id-4' id='type-id-448'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-50' size-in-bits='8' id='type-id-421'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-4' id='type-id-5'/>
    </array-type-def>
    <union-decl name='__atomic_wide_counter' size-in-bits='64' naming-typedef-id='type-id-432' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h' line='25' column='1' id='type-id-440'>
      <data-member access='public'>
        <var-decl name='__value64' type-id='type-id-201' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h' line='27' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__value32' type-id='type-id-437' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h' line='32' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='pthread_cond_t' size-in-bits='384' naming-typedef-id='type-id-442' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='75' column='1' id='type-id-441'>
      <data-member access='public'>
        <var-decl name='__data' type-id='type-id-431' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='77' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-409' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='78' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-23' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='79' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='pthread_condattr_t' size-in-bits='32' naming-typedef-id='type-id-444' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='41' column='1' id='type-id-443'>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-11' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='43' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-21' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='44' column='1'/>
      </data-member>
    </union-decl>
    <array-type-def dimensions='1' type-id='type-id-70' size-in-bits='64' id='type-id-433'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-4' id='type-id-449'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-438' size-in-bits='64' id='type-id-450'/>
    <pointer-type-def type-id='type-id-451' size-in-bits='64' id='type-id-439'/>
    <pointer-type-def type-id='type-id-417' size-in-bits='64' id='type-id-415'/>
    <pointer-type-def type-id='type-id-419' size-in-bits='64' id='type-id-426'/>
    <pointer-type-def type-id='type-id-422' size-in-bits='64' id='type-id-416'/>
    <pointer-type-def type-id='type-id-427' size-in-bits='64' id='type-id-414'/>
    <pointer-type-def type-id='type-id-452' size-in-bits='64' id='type-id-402'/>
    <qualified-type-def type-id='type-id-434' const='yes' id='type-id-453'/>
    <pointer-type-def type-id='type-id-453' size-in-bits='64' id='type-id-454'/>
    <qualified-type-def type-id='type-id-444' const='yes' id='type-id-455'/>
    <pointer-type-def type-id='type-id-455' size-in-bits='64' id='type-id-456'/>
    <qualified-type-def type-id='type-id-456' restrict='yes' id='type-id-457'/>
    <qualified-type-def type-id='type-id-129' const='yes' id='type-id-458'/>
    <pointer-type-def type-id='type-id-458' size-in-bits='64' id='type-id-459'/>
    <qualified-type-def type-id='type-id-190' const='yes' id='type-id-460'/>
    <pointer-type-def type-id='type-id-460' size-in-bits='64' id='type-id-461'/>
    <qualified-type-def type-id='type-id-340' restrict='yes' id='type-id-462'/>
    <pointer-type-def type-id='type-id-463' size-in-bits='64' id='type-id-446'/>
    <pointer-type-def type-id='type-id-464' size-in-bits='64' id='type-id-465'/>
